citys ={
    "chengdu":101270100
}
city_info = {
        "chengdu": [
                {
                    "code": 510108,
                    "name": "成华区",
                    "subLevelModelList": [
                        {
                            "code": 83677937,
                            "name": "339购物中心",
                            
                        },
                        {
                            "code": 92628903,
                            "name": "半边街",
                            
                        },
                        {
                            "code": 2015,
                            "name": "保和",
                            
                        },
                        {
                            "code": 37714945,
                            "name": "八里小区",
                            
                        },
                        {
                            "code": 5757,
                            "name": "八里庄",
                            
                        },
                        {
                            "code": 34621939,
                            "name": "成都东站",
                            
                        },
                        {
                            "code": 82977847,
                            "name": "成都理工",
                            
                        },
                        {
                            "code": 34624304,
                            "name": "财富又一城",
                            
                        },
                        {
                            "code": 55945694,
                            "name": "成渝立交",
                            
                        },
                        {
                            "code": 34572311,
                            "name": "东郊记忆",
                            
                        },
                        {
                            "code": 49300331,
                            "name": "东客站",
                            
                        },
                        {
                            "code": 34570718,
                            "name": "动物园",
                            
                        },
                        {
                            "code": 82240854,
                            "name": "电子科技大学",
                            
                        },
                        {
                            "code": 3703,
                            "name": "二仙桥",
                            
                        },
                        {
                            "code": 62903253,
                            "name": "府青路",
                            
                        },
                        {
                            "code": 81787636,
                            "name": "高笋塘",
                            
                        },
                        {
                            "code": 38795141,
                            "name": "火车北站",
                            
                        },
                        {
                            "code": 82682110,
                            "name": "火车东站",
                            
                        },
                        {
                            "code": 34736875,
                            "name": "红星路",
                            
                        },
                        {
                            "code": 428,
                            "name": "建设路",
                            
                        },
                        {
                            "code": 55519752,
                            "name": "凯德广场",
                            
                        },
                        {
                            "code": 48664133,
                            "name": "理工大",
                            
                        },
                        {
                            "code": 62612252,
                            "name": "龙湖三千集",
                            
                        },
                        {
                            "code": 1737,
                            "name": "李家沱",
                            
                        },
                        {
                            "code": 1174,
                            "name": "龙潭",
                            
                        },
                        {
                            "code": 575,
                            "name": "猛追湾",
                            
                        },
                        {
                            "code": 7125,
                            "name": "牛王庙",
                            
                        },
                        {
                            "code": 1558,
                            "name": "青龙场",
                            
                        },
                        {
                            "code": 3351,
                            "name": "圣灯",
                            
                        },
                        {
                            "code": 82495933,
                            "name": "双荆路",
                            
                        },
                        {
                            "code": 10553,
                            "name": "十陵",
                            
                        },
                        {
                            "code": 34598024,
                            "name": "十里店",
                            
                        },
                        {
                            "code": 3036,
                            "name": "双林路",
                            
                        },
                        {
                            "code": 34573636,
                            "name": "SM广场",
                            
                        },
                        {
                            "code": 40,
                            "name": "驷马桥",
                            
                        },
                        {
                            "code": 82129914,
                            "name": "水碾河",
                            
                        },
                        {
                            "code": 2881,
                            "name": "双桥子",
                            
                        },
                        {
                            "code": 62904144,
                            "name": "双水碾",
                            
                        },
                        {
                            "code": 62905611,
                            "name": "跳蹬河",
                            
                        },
                        {
                            "code": 62918977,
                            "name": "桃蹊路",
                            
                        },
                        {
                            "code": 83529957,
                            "name": "五桂桥",
                            
                        },
                        {
                            "code": 34793983,
                            "name": "五块石",
                            
                        },
                        {
                            "code": 742,
                            "name": "万年场",
                            
                        },
                        {
                            "code": 34572859,
                            "name": "万象城",
                            
                        },
                        {
                            "code": 34970849,
                            "name": "新华公园",
                            
                        },
                        {
                            "code": 3720,
                            "name": "新鸿路",
                            
                        },
                        {
                            "code": 35618652,
                            "name": "熊猫基地",
                            
                        }
                    ]
                },
                {
                    "code": 510107,
                    "name": "武侯区",
                    "subLevelModelList": [
                        {
                            "code": 34591773,
                            "name": "保利花园",
                            
                        },
                        {
                            "code": 34576062,
                            "name": "川大",
                            
                        },
                        {
                            "code": 48731438,
                            "name": "草金立交",
                            
                        },
                        {
                            "code": 2145,
                            "name": "簇桥",
                            
                        },
                        {
                            "code": 49202359,
                            "name": "川音",
                            
                        },
                        {
                            "code": 840,
                            "name": "创业路",
                            
                        },
                        {
                            "code": 6124,
                            "name": "东坡",
                            
                        },
                        {
                            "code": 81900774,
                            "name": "大石西路",
                            
                        },
                        {
                            "code": 85244368,
                            "name": "电信路",
                            
                        },
                        {
                            "code": 48626158,
                            "name": "大源",
                            
                        },
                        {
                            "code": 34568893,
                            "name": "复城国际广场",
                            
                        },
                        {
                            "code": 99289100,
                            "name": "芳草街",
                            
                        },
                        {
                            "code": 34569845,
                            "name": "孵化园",
                            
                        },
                        {
                            "code": 222876563,
                            "name": "高朋大道",
                            
                        },
                        {
                            "code": 1403,
                            "name": "高升桥",
                            
                        },
                        {
                            "code": 2046,
                            "name": "桂溪",
                            
                        },
                        {
                            "code": 90676890,
                            "name": "河滨路",
                            
                        },
                        {
                            "code": 707,
                            "name": "火车南站",
                            
                        },
                        {
                            "code": 34570574,
                            "name": "汇锦城",
                            
                        },
                        {
                            "code": 49237454,
                            "name": "航空港",
                            
                        },
                        {
                            "code": 34591202,
                            "name": "航空路",
                            
                        },
                        {
                            "code": 336,
                            "name": "红牌楼",
                            
                        },
                        {
                            "code": 34570802,
                            "name": "环球中心",
                            
                        },
                        {
                            "code": 56259882,
                            "name": "红瓦寺",
                            
                        },
                        {
                            "code": 34602969,
                            "name": "华西",
                            
                        },
                        {
                            "code": 34575133,
                            "name": "九方购物中心",
                            
                        },
                        {
                            "code": 34591616,
                            "name": "金花",
                            
                        },
                        {
                            "code": 38865634,
                            "name": "金融城",
                            
                        },
                        {
                            "code": 34566586,
                            "name": "机投",
                            
                        },
                        {
                            "code": 1875,
                            "name": "浆洗街",
                            
                        },
                        {
                            "code": 294,
                            "name": "九眼桥",
                            
                        },
                        {
                            "code": 192,
                            "name": "科华北路",
                            
                        },
                        {
                            "code": 69362694,
                            "name": "科华中路",
                            
                        },
                        {
                            "code": 82097991,
                            "name": "科华中路王府井",
                            
                        },
                        {
                            "code": 37750103,
                            "name": "丽都",
                            
                        },
                        {
                            "code": 34935134,
                            "name": "鹭岛国际",
                            
                        },
                        {
                            "code": 35681497,
                            "name": "龙湖金楠天街",
                            
                        },
                        {
                            "code": 39049038,
                            "name": "龙腾路",
                            
                        },
                        {
                            "code": 2200,
                            "name": "磨子桥",
                            
                        },
                        {
                            "code": 82802594,
                            "name": "清水河公园",
                            
                        },
                        {
                            "code": 6080,
                            "name": "青羊大道",
                            
                        },
                        {
                            "code": 104461781,
                            "name": "燃灯寺",
                            
                        },
                        {
                            "code": 64474363,
                            "name": "世豪广场",
                            
                        },
                        {
                            "code": 693,
                            "name": "双楠",
                            
                        },
                        {
                            "code": 37954761,
                            "name": "省体育馆",
                            
                        },
                        {
                            "code": 1232,
                            "name": "神仙树",
                            
                        },
                        {
                            "code": 34566431,
                            "name": "石羊场",
                            
                        },
                        {
                            "code": 49896965,
                            "name": "市一医院",
                            
                        },
                        {
                            "code": 34611795,
                            "name": "天府长城",
                            
                        },
                        {
                            "code": 67505180,
                            "name": "天府立交",
                            
                        },
                        {
                            "code": 1092,
                            "name": "跳伞塔",
                            
                        },
                        {
                            "code": 80953086,
                            "name": "铁像寺",
                            
                        },
                        {
                            "code": 1387,
                            "name": "桐梓林",
                            
                        },
                        {
                            "code": 34577227,
                            "name": "五大花园",
                            
                        },
                        {
                            "code": 1552,
                            "name": "武侯祠",
                            
                        },
                        {
                            "code": 48756633,
                            "name": "武侯立交",
                            
                        },
                        {
                            "code": 2866,
                            "name": "望江路",
                            
                        },
                        {
                            "code": 34583026,
                            "name": "外双楠",
                            
                        },
                        {
                            "code": 34566638,
                            "name": "新会展中心",
                            
                        },
                        {
                            "code": 1722,
                            "name": "肖家河",
                            
                        },
                        {
                            "code": 82182034,
                            "name": "洗面桥街",
                            
                        },
                        {
                            "code": 34610837,
                            "name": "新南门",
                            
                        },
                        {
                            "code": 3063,
                            "name": "小天竺",
                            
                        },
                        {
                            "code": 83192153,
                            "name": "永丰路",
                            
                        },
                        {
                            "code": 57929030,
                            "name": "衣冠庙",
                            
                        },
                        {
                            "code": 930,
                            "name": "玉林",
                            
                        },
                        {
                            "code": 34569270,
                            "name": "伊藤",
                            
                        },
                        {
                            "code": 34566631,
                            "name": "银泰城",
                            
                        },
                        {
                            "code": 55895324,
                            "name": "棕北",
                            
                        },
                        {
                            "code": 6186,
                            "name": "中和",
                            
                        },
                        {
                            "code": 377,
                            "name": "紫荆",
                            
                        }
                    ]
                },
                {
                    "code": 510106,
                    "name": "金牛区",
                    "subLevelModelList": [
                        {
                            "code": 82241204,
                            "name": "白果林",
                            
                        },
                        {
                            "code": 81998786,
                            "name": "北门大桥",
                            
                        },
                        {
                            "code": 69066145,
                            "name": "成都军区总医院",
                            
                        },
                        {
                            "code": 983,
                            "name": "茶店子",
                            
                        },
                        {
                            "code": 2060,
                            "name": "城隍庙",
                            
                        },
                        {
                            "code": 82240569,
                            "name": "洞子口",
                            
                        },
                        {
                            "code": 489,
                            "name": "抚琴",
                            
                        },
                        {
                            "code": 34586746,
                            "name": "国宾",
                            
                        },
                        {
                            "code": 34884638,
                            "name": "高家庄",
                            
                        },
                        {
                            "code": 81866168,
                            "name": "高笋塘",
                            
                        },
                        {
                            "code": 34591389,
                            "name": "火车北站",
                            
                        },
                        {
                            "code": 34584168,
                            "name": "荷花池",
                            
                        },
                        {
                            "code": 34634030,
                            "name": "欢乐谷",
                            
                        },
                        {
                            "code": 34575832,
                            "name": "花牌坊",
                            
                        },
                        {
                            "code": 34656859,
                            "name": "华侨城",
                            
                        },
                        {
                            "code": 55558676,
                            "name": "花照壁",
                            
                        },
                        {
                            "code": 2728,
                            "name": "交大路",
                            
                        },
                        {
                            "code": 81522179,
                            "name": "金府",
                            
                        },
                        {
                            "code": 6227,
                            "name": "解放路",
                            
                        },
                        {
                            "code": 2877,
                            "name": "九里堤",
                            
                        },
                        {
                            "code": 34577867,
                            "name": "金牛万达",
                            
                        },
                        {
                            "code": 798,
                            "name": "金泉",
                            
                        },
                        {
                            "code": 1975,
                            "name": "金沙",
                            
                        },
                        {
                            "code": 82380747,
                            "name": "凯德广场·金牛",
                            
                        },
                        {
                            "code": 5865,
                            "name": "李家沱",
                            
                        },
                        {
                            "code": 2202,
                            "name": "梁家巷",
                            
                        },
                        {
                            "code": 49925660,
                            "name": "马鞍路",
                            
                        },
                        {
                            "code": 829,
                            "name": "人民北路",
                            
                        },
                        {
                            "code": 1626,
                            "name": "蜀汉路",
                            
                        },
                        {
                            "code": 2686,
                            "name": "沙河源",
                            
                        },
                        {
                            "code": 2919,
                            "name": "驷马桥",
                            
                        },
                        {
                            "code": 63906585,
                            "name": "石人小区",
                            
                        },
                        {
                            "code": 592,
                            "name": "沙湾",
                            
                        },
                        {
                            "code": 3135,
                            "name": "天回",
                            
                        },
                        {
                            "code": 51153958,
                            "name": "通惠门",
                            
                        },
                        {
                            "code": 34571366,
                            "name": "五块石",
                            
                        },
                        {
                            "code": 34581705,
                            "name": "西安北路",
                            
                        },
                        {
                            "code": 763,
                            "name": "西南交大",
                            
                        },
                        {
                            "code": 82247971,
                            "name": "永陵路",
                            
                        },
                        {
                            "code": 1141,
                            "name": "营门口",
                            
                        },
                        {
                            "code": 34869799,
                            "name": "一品天下",
                            
                        },
                        {
                            "code": 34777693,
                            "name": "羊西线",
                            
                        },
                        {
                            "code": 34572998,
                            "name": "中海国际",
                            
                        },
                        {
                            "code": 95965507,
                            "name": "中医大省医院",
                            
                        }
                    ]
                },
                {
                    "code": 510105,
                    "name": "青羊区",
                    "subLevelModelList": [
                        {
                            "code": 1178,
                            "name": "八宝街",
                            
                        },
                        {
                            "code": 34590307,
                            "name": "贝森",
                            
                        },
                        {
                            "code": 34639367,
                            "name": "成飞大道",
                            
                        },
                        {
                            "code": 6629,
                            "name": "城隍庙",
                            
                        },
                        {
                            "code": 2283,
                            "name": "草市街",
                            
                        },
                        {
                            "code": 1269,
                            "name": "草堂",
                            
                        },
                        {
                            "code": 7105,
                            "name": "春熙路",
                            
                        },
                        {
                            "code": 471,
                            "name": "东坡",
                            
                        },
                        {
                            "code": 3436,
                            "name": "府南",
                            
                        },
                        {
                            "code": 6846,
                            "name": "抚琴",
                            
                        },
                        {
                            "code": 940,
                            "name": "光华",
                            
                        },
                        {
                            "code": 88475462,
                            "name": "光华大道",
                            
                        },
                        {
                            "code": 83473558,
                            "name": "浣花溪",
                            
                        },
                        {
                            "code": 617,
                            "name": "黄田坝",
                            
                        },
                        {
                            "code": 6851,
                            "name": "红星路",
                            
                        },
                        {
                            "code": 7689,
                            "name": "黄忠",
                            
                        },
                        {
                            "code": 1287,
                            "name": "金沙",
                            
                        },
                        {
                            "code": 34573913,
                            "name": "宽窄巷子",
                            
                        },
                        {
                            "code": 34613325,
                            "name": "骡马市",
                            
                        },
                        {
                            "code": 34583750,
                            "name": "鹏瑞利.青羊广场",
                            
                        },
                        {
                            "code": 1294,
                            "name": "清江",
                            
                        },
                        {
                            "code": 82483851,
                            "name": "清江东路",
                            
                        },
                        {
                            "code": 81766330,
                            "name": "清江西路",
                            
                        },
                        {
                            "code": 34870561,
                            "name": "琴台",
                            
                        },
                        {
                            "code": 1863,
                            "name": "青羊大道",
                            
                        },
                        {
                            "code": 34581649,
                            "name": "青羊宫",
                            
                        },
                        {
                            "code": 34571360,
                            "name": "青羊万达",
                            
                        },
                        {
                            "code": 34609944,
                            "name": "人民公园",
                            
                        },
                        {
                            "code": 2711,
                            "name": "蜀汉路",
                            
                        },
                        {
                            "code": 49162632,
                            "name": "苏坡",
                            
                        },
                        {
                            "code": 1157,
                            "name": "天府广场",
                            
                        },
                        {
                            "code": 82250024,
                            "name": "通锦桥",
                            
                        },
                        {
                            "code": 1325,
                            "name": "太升路",
                            
                        },
                        {
                            "code": 48194121,
                            "name": "外光华",
                            
                        },
                        {
                            "code": 1675,
                            "name": "文家",
                            
                        },
                        {
                            "code": 2172,
                            "name": "汪家拐",
                            
                        },
                        {
                            "code": 37327310,
                            "name": "外金沙",
                            
                        },
                        {
                            "code": 48818807,
                            "name": "万家湾",
                            
                        },
                        {
                            "code": 70996381,
                            "name": "文殊院",
                            
                        },
                        {
                            "code": 82378065,
                            "name": "西单商场",
                            
                        },
                        {
                            "code": 59894135,
                            "name": "西南财经大学",
                            
                        },
                        {
                            "code": 34743088,
                            "name": "优品道",
                            
                        },
                        {
                            "code": 1757,
                            "name": "盐市口",
                            
                        },
                        {
                            "code": 82812720,
                            "name": "中坝",
                            
                        }
                    ]
                },
                {
                    "code": 510104,
                    "name": "锦江区",
                    "subLevelModelList": [
                        {
                            "code": 61131275,
                            "name": "成龙路",
                            
                        },
                        {
                            "code": 34606674,
                            "name": "川师",
                            
                        },
                        {
                            "code": 733,
                            "name": "春熙路",
                            
                        },
                        {
                            "code": 64514578,
                            "name": "东大街",
                            
                        },
                        {
                            "code": 55808283,
                            "name": "东大路",
                            
                        },
                        {
                            "code": 102731945,
                            "name": "东风大桥",
                            
                        },
                        {
                            "code": 2643,
                            "name": "东光",
                            
                        },
                        {
                            "code": 56215769,
                            "name": "东湖",
                            
                        },
                        {
                            "code": 36952902,
                            "name": "火车南站",
                            
                        },
                        {
                            "code": 34637133,
                            "name": "海椒市",
                            
                        },
                        {
                            "code": 34576606,
                            "name": "合江亭",
                            
                        },
                        {
                            "code": 307,
                            "name": "红星路",
                            
                        },
                        {
                            "code": 82553185,
                            "name": "锦华万达",
                            
                        },
                        {
                            "code": 34606206,
                            "name": "静居寺",
                            
                        },
                        {
                            "code": 1042,
                            "name": "九眼桥",
                            
                        },
                        {
                            "code": 50081672,
                            "name": "蓝谷地",
                            
                        },
                        {
                            "code": 65224360,
                            "name": "兰桂坊",
                            
                        },
                        {
                            "code": 82950589,
                            "name": "莲桂路",
                            
                        },
                        {
                            "code": 34610675,
                            "name": "莲桂南路",
                            
                        },
                        {
                            "code": 54344243,
                            "name": "柳江",
                            
                        },
                        {
                            "code": 34577067,
                            "name": "琉璃场",
                            
                        },
                        {
                            "code": 62979504,
                            "name": "莲新",
                            
                        },
                        {
                            "code": 2835,
                            "name": "龙舟路",
                            
                        },
                        {
                            "code": 3264,
                            "name": "猛追湾",
                            
                        },
                        {
                            "code": 1027,
                            "name": "牛市口",
                            
                        },
                        {
                            "code": 1984,
                            "name": "牛王庙",
                            
                        },
                        {
                            "code": 49261907,
                            "name": "攀成钢",
                            
                        },
                        {
                            "code": 34591960,
                            "name": "四川师大",
                            
                        },
                        {
                            "code": 62913875,
                            "name": "双桂路",
                            
                        },
                        {
                            "code": 55860779,
                            "name": "三官堂",
                            
                        },
                        {
                            "code": 34585611,
                            "name": "沙河",
                            
                        },
                        {
                            "code": 34616917,
                            "name": "水碾河",
                            
                        },
                        {
                            "code": 921,
                            "name": "三圣",
                            
                        },
                        {
                            "code": 81016005,
                            "name": "三圣乡",
                            
                        },
                        {
                            "code": 62901914,
                            "name": "书院街",
                            
                        },
                        {
                            "code": 2342,
                            "name": "天府广场",
                            
                        },
                        {
                            "code": 82418113,
                            "name": "太古里",
                            
                        },
                        {
                            "code": 2628,
                            "name": "太升路",
                            
                        },
                        {
                            "code": 62568835,
                            "name": "塔子山公园",
                            
                        },
                        {
                            "code": 55553721,
                            "name": "万达广场",
                            
                        },
                        {
                            "code": 7456,
                            "name": "汪家拐",
                            
                        },
                        {
                            "code": 7074,
                            "name": "望江路",
                            
                        },
                        {
                            "code": 1135,
                            "name": "盐市口",
                            
                        },
                        {
                            "code": 48861030,
                            "name": "卓锦城",
                            
                        }
                    ]
                },
                {
                    "code": 510183,
                    "name": "邛崃市",
                    "subLevelModelList": [
                        {
                            "code": 93386331,
                            "name": "固驿镇",
                            
                        },
                        {
                            "code": 8592,
                            "name": "火井",
                            
                        },
                        {
                            "code": 66031776,
                            "name": "回龙",
                            
                        },
                        {
                            "code": 85223481,
                            "name": "金桂街",
                            
                        },
                        {
                            "code": 37628107,
                            "name": "君威广场",
                            
                        },
                        {
                            "code": 107700848,
                            "name": "临济",
                            
                        },
                        {
                            "code": 3249,
                            "name": "临邛",
                            
                        },
                        {
                            "code": 66237242,
                            "name": "牟礼村",
                            
                        },
                        {
                            "code": 97872577,
                            "name": "南宝山木梯羌寨",
                            
                        },
                        {
                            "code": 37937521,
                            "name": "女人街",
                            
                        },
                        {
                            "code": 90524608,
                            "name": "平乐古镇",
                            
                        },
                        {
                            "code": 36266546,
                            "name": "前进",
                            
                        },
                        {
                            "code": 82603477,
                            "name": "钱江凤凰城",
                            
                        },
                        {
                            "code": 82847376,
                            "name": "邛崃家乐福",
                            
                        },
                        {
                            "code": 104037001,
                            "name": "水口",
                            
                        },
                        {
                            "code": 8595,
                            "name": "天台山",
                            
                        },
                        {
                            "code": 7361,
                            "name": "羊安",
                            
                        }
                    ]
                },
                {
                    "code": 510182,
                    "name": "彭州市",
                    "subLevelModelList": [
                        {
                            "code": 7939,
                            "name": "安仁",
                            
                        },
                        {
                            "code": 84794329,
                            "name": "北大街",
                            
                        },
                        {
                            "code": 74990727,
                            "name": "白鹿镇",
                            
                        },
                        {
                            "code": 81559852,
                            "name": "朝阳中路",
                            
                        },
                        {
                            "code": 81522775,
                            "name": "丽春镇",
                            
                        },
                        {
                            "code": 37634349,
                            "name": "隆丰",
                            
                        },
                        {
                            "code": 35467229,
                            "name": "濛阳镇",
                            
                        },
                        {
                            "code": 35131547,
                            "name": "南部新城",
                            
                        },
                        {
                            "code": 81071707,
                            "name": "上柳河",
                            
                        },
                        {
                            "code": 55848804,
                            "name": "天彭街道",
                            
                        },
                        {
                            "code": 81172660,
                            "name": "天彭镇",
                            
                        },
                        {
                            "code": 82045972,
                            "name": "沃尔玛",
                            
                        },
                        {
                            "code": 81212636,
                            "name": "西华大学",
                            
                        },
                        {
                            "code": 125206188,
                            "name": "小鱼洞",
                            
                        },
                        {
                            "code": 6509,
                            "name": "致和",
                            
                        }
                    ]
                },
                {
                    "code": 510181,
                    "name": "都江堰市",
                    "subLevelModelList": [
                        {
                            "code": 42273345,
                            "name": "百伦广场",
                            
                        },
                        {
                            "code": 36839463,
                            "name": "柏条河",
                            
                        },
                        {
                            "code": 64523451,
                            "name": "北外街",
                            
                        },
                        {
                            "code": 7566,
                            "name": "大观",
                            
                        },
                        {
                            "code": 34769050,
                            "name": "都江堰快铁站",
                            
                        },
                        {
                            "code": 35500207,
                            "name": "都江堰市体育中心",
                            
                        },
                        {
                            "code": 37462286,
                            "name": "都江堰市中医医院",
                            
                        },
                        {
                            "code": 1672,
                            "name": "灌口",
                            
                        },
                        {
                            "code": 88708692,
                            "name": "花园",
                            
                        },
                        {
                            "code": 38913636,
                            "name": "金融中心",
                            
                        },
                        {
                            "code": 88423501,
                            "name": "九寨花苑",
                            
                        },
                        {
                            "code": 82428226,
                            "name": "蒲阳镇",
                            
                        },
                        {
                            "code": 51433104,
                            "name": "青城后山",
                            
                        },
                        {
                            "code": 5892,
                            "name": "青城山",
                            
                        },
                        {
                            "code": 82720230,
                            "name": "天籁村",
                            
                        },
                        {
                            "code": 2773,
                            "name": "幸福",
                            
                        },
                        {
                            "code": 36564544,
                            "name": "学府路",
                            
                        },
                        {
                            "code": 84286341,
                            "name": "新马路",
                            
                        },
                        {
                            "code": 35355531,
                            "name": "壹街区",
                            
                        },
                        {
                            "code": 77815865,
                            "name": "玉垒山公园",
                            
                        },
                        {
                            "code": 7489,
                            "name": "玉堂",
                            
                        },
                        {
                            "code": 82522126,
                            "name": "中兴镇",
                            
                        }
                    ]
                },
                {
                    "code": 510117,
                    "name": "郫都区",
                    "subLevelModelList": [
                        {
                            "code": 81439746,
                            "name": "安德镇",
                            
                        },
                        {
                            "code": 10265,
                            "name": "安靖",
                            
                        },
                        {
                            "code": 35055043,
                            "name": "成外",
                            
                        },
                        {
                            "code": 10557,
                            "name": "大丰",
                            
                        },
                        {
                            "code": 81229537,
                            "name": "德源镇",
                            
                        },
                        {
                            "code": 34593689,
                            "name": "高新西",
                            
                        },
                        {
                            "code": 10245,
                            "name": "红光镇",
                            
                        },
                        {
                            "code": 35568613,
                            "name": "合能四季城",
                            
                        },
                        {
                            "code": 10253,
                            "name": "郫筒",
                            
                        },
                        {
                            "code": 80983355,
                            "name": "郫县城区",
                            
                        },
                        {
                            "code": 81141574,
                            "name": "郫县万达",
                            
                        },
                        {
                            "code": 36148545,
                            "name": "蜀都万达",
                            
                        },
                        {
                            "code": 10500,
                            "name": "三道堰",
                            
                        },
                        {
                            "code": 53604181,
                            "name": "唐昌",
                            
                        },
                        {
                            "code": 10287,
                            "name": "团结",
                            
                        },
                        {
                            "code": 70612282,
                            "name": "新民场",
                            
                        },
                        {
                            "code": 10248,
                            "name": "犀浦",
                            
                        },
                        {
                            "code": 85010163,
                            "name": "橡树湾",
                            
                        },
                        {
                            "code": 83787004,
                            "name": "友爱镇",
                            
                        },
                        {
                            "code": 34608534,
                            "name": "中海国际",
                            
                        }
                    ]
                },
                {
                    "code": 510116,
                    "name": "双流区",
                    "subLevelModelList": [
                        {
                            "code": 35028622,
                            "name": "奥特莱斯",
                            
                        },
                        {
                            "code": 1529,
                            "name": "白家",
                            
                        },
                        {
                            "code": 81628926,
                            "name": "白沙镇",
                            
                        },
                        {
                            "code": 222885774,
                            "name": "成都高新区",
                            
                        },
                        {
                            "code": 64274219,
                            "name": "城南优品道广场",
                            
                        },
                        {
                            "code": 1911,
                            "name": "东升",
                            
                        },
                        {
                            "code": 35790242,
                            "name": "广都",
                            
                        },
                        {
                            "code": 108937017,
                            "name": "钢铁镇",
                            
                        },
                        {
                            "code": 1723,
                            "name": "公兴",
                            
                        },
                        {
                            "code": 81191893,
                            "name": "海滨城",
                            
                        },
                        {
                            "code": 34593504,
                            "name": "华府",
                            
                        },
                        {
                            "code": 3011,
                            "name": "黄甲",
                            
                        },
                        {
                            "code": 35208763,
                            "name": "航空港",
                            
                        },
                        {
                            "code": 3239,
                            "name": "黄龙溪",
                            
                        },
                        {
                            "code": 6547,
                            "name": "黄水",
                            
                        },
                        {
                            "code": 1113,
                            "name": "华阳",
                            
                        },
                        {
                            "code": 35108488,
                            "name": "海洋公园",
                            
                        },
                        {
                            "code": 2333,
                            "name": "九江",
                            
                        },
                        {
                            "code": 34569505,
                            "name": "蛟龙港",
                            
                        },
                        {
                            "code": 34615200,
                            "name": "九龙湖",
                            
                        },
                        {
                            "code": 82695959,
                            "name": "戛纳湾",
                            
                        },
                        {
                            "code": 6863,
                            "name": "金桥",
                            
                        },
                        {
                            "code": 82697264,
                            "name": "籍田街道",
                            
                        },
                        {
                            "code": 48417842,
                            "name": "警院",
                            
                        },
                        {
                            "code": 35001383,
                            "name": "麓湖生态城",
                            
                        },
                        {
                            "code": 34571450,
                            "name": "麓山",
                            
                        },
                        {
                            "code": 34578507,
                            "name": "牧马山",
                            
                        },
                        {
                            "code": 35944563,
                            "name": "南湖",
                            
                        },
                        {
                            "code": 58616280,
                            "name": "仁寿",
                            
                        },
                        {
                            "code": 71861894,
                            "name": "四川大学江安校区",
                            
                        },
                        {
                            "code": 34600925,
                            "name": "四川现代职业学院",
                            
                        },
                        {
                            "code": 37728402,
                            "name": "双流城区",
                            
                        },
                        {
                            "code": 34570678,
                            "name": "双流机场",
                            
                        },
                        {
                            "code": 81172073,
                            "name": "双流万达",
                            
                        },
                        {
                            "code": 222885772,
                            "name": "天府新区",
                            
                        },
                        {
                            "code": 62965686,
                            "name": "万安",
                            
                        },
                        {
                            "code": 2927,
                            "name": "文星",
                            
                        },
                        {
                            "code": 81112448,
                            "name": "兴隆街道",
                            
                        },
                        {
                            "code": 7287,
                            "name": "新兴",
                            
                        },
                        {
                            "code": 84913291,
                            "name": "永安镇",
                            
                        },
                        {
                            "code": 48712795,
                            "name": "远大",
                            
                        },
                        {
                            "code": 67879356,
                            "name": "雅居乐",
                            
                        },
                        {
                            "code": 84821709,
                            "name": "永兴街道",
                            
                        },
                        {
                            "code": 72382490,
                            "name": "益州国际广场",
                            
                        },
                        {
                            "code": 35166547,
                            "name": "中德",
                            
                        },
                        {
                            "code": 1647,
                            "name": "中和",
                            
                        },
                        {
                            "code": 7393,
                            "name": "正兴",
                            
                        }
                    ]
                },
                {
                    "code": 510115,
                    "name": "温江区",
                    "subLevelModelList": [
                        {
                            "code": 82750094,
                            "name": "成都师范学院温江校区",
                            
                        },
                        {
                            "code": 55346786,
                            "name": "凤凰大街",
                            
                        },
                        {
                            "code": 34578206,
                            "name": "芙蓉古城",
                            
                        },
                        {
                            "code": 81288036,
                            "name": "凤溪大道",
                            
                        },
                        {
                            "code": 67150370,
                            "name": "光华大道",
                            
                        },
                        {
                            "code": 6057,
                            "name": "公平",
                            
                        },
                        {
                            "code": 34592326,
                            "name": "国色天乡",
                            
                        },
                        {
                            "code": 34571340,
                            "name": "花都大道",
                            
                        },
                        {
                            "code": 87155443,
                            "name": "花园",
                            
                        },
                        {
                            "code": 1137,
                            "name": "金马镇",
                            
                        },
                        {
                            "code": 15,
                            "name": "柳城",
                            
                        },
                        {
                            "code": 82901519,
                            "name": "柳浪湾",
                            
                        },
                        {
                            "code": 82731012,
                            "name": "四川农业大学",
                            
                        },
                        {
                            "code": 46443775,
                            "name": "四川艺术职业学院温江校区",
                            
                        },
                        {
                            "code": 83380531,
                            "name": "泰迪熊博物馆",
                            
                        },
                        {
                            "code": 2824,
                            "name": "天府",
                            
                        },
                        {
                            "code": 1664,
                            "name": "万春",
                            
                        },
                        {
                            "code": 7285,
                            "name": "文家",
                            
                        },
                        {
                            "code": 34569964,
                            "name": "温江大学城",
                            
                        },
                        {
                            "code": 82582200,
                            "name": "温江老城",
                            
                        },
                        {
                            "code": 50262577,
                            "name": "温江新城",
                            
                        },
                        {
                            "code": 87550595,
                            "name": "温江校区",
                            
                        },
                        {
                            "code": 81947850,
                            "name": "永宁镇",
                            
                        },
                        {
                            "code": 1718,
                            "name": "涌泉",
                            
                        },
                        {
                            "code": 34572738,
                            "name": "珠江国际",
                            
                        },
                        {
                            "code": 49719871,
                            "name": "珠江新城",
                            
                        }
                    ]
                },
                {
                    "code": 510114,
                    "name": "新都区",
                    "subLevelModelList": [
                        {
                            "code": 57727960,
                            "name": "缤纷时代广场",
                            
                        },
                        {
                            "code": 57867914,
                            "name": "宝光寺",
                            
                        },
                        {
                            "code": 35247499,
                            "name": "保利公园",
                            
                        },
                        {
                            "code": 1962,
                            "name": "斑竹园",
                            
                        },
                        {
                            "code": 1270,
                            "name": "大丰",
                            
                        },
                        {
                            "code": 58271457,
                            "name": "电子路",
                            
                        },
                        {
                            "code": 82235449,
                            "name": "桂湖",
                            
                        },
                        {
                            "code": 81925905,
                            "name": "静安路",
                            
                        },
                        {
                            "code": 2021,
                            "name": "龙桥",
                            
                        },
                        {
                            "code": 81193684,
                            "name": "木兰山",
                            
                        },
                        {
                            "code": 35674414,
                            "name": "毗河",
                            
                        },
                        {
                            "code": 111630300,
                            "name": "青白江",
                            
                        },
                        {
                            "code": 7445,
                            "name": "石板滩",
                            
                        },
                        {
                            "code": 34615060,
                            "name": "四川音乐学院",
                            
                        },
                        {
                            "code": 2365,
                            "name": "三河",
                            
                        },
                        {
                            "code": 3489,
                            "name": "天回",
                            
                        },
                        {
                            "code": 81520953,
                            "name": "泰兴镇",
                            
                        },
                        {
                            "code": 57448183,
                            "name": "天缘路",
                            
                        },
                        {
                            "code": 81301364,
                            "name": "体育森林公园",
                            
                        },
                        {
                            "code": 80988817,
                            "name": "新都城区",
                            
                        },
                        {
                            "code": 81026816,
                            "name": "新都物流基地",
                            
                        },
                        {
                            "code": 2598,
                            "name": "新繁",
                            
                        },
                        {
                            "code": 35681482,
                            "name": "新民镇",
                            
                        },
                        {
                            "code": 35077752,
                            "name": "西南石油大学",
                            
                        }
                    ]
                },
                {
                    "code": 510113,
                    "name": "青白江区",
                    "subLevelModelList": [
                        {
                            "code": 5914,
                            "name": "大弯",
                            
                        },
                        {
                            "code": 5959,
                            "name": "红阳",
                            
                        },
                        {
                            "code": 34571661,
                            "name": "幸福家园",
                            
                        }
                    ]
                },
                {
                    "code": 510112,
                    "name": "龙泉驿区",
                    "subLevelModelList": [
                        {
                            "code": 83133758,
                            "name": "半边街",
                            
                        },
                        {
                            "code": 35376169,
                            "name": "柏合镇",
                            
                        },
                        {
                            "code": 35163557,
                            "name": "北泉路",
                            
                        },
                        {
                            "code": 82727209,
                            "name": "成龙路",
                            
                        },
                        {
                            "code": 67495848,
                            "name": "成渝立交",
                            
                        },
                        {
                            "code": 2616,
                            "name": "大面",
                            
                        },
                        {
                            "code": 34577373,
                            "name": "东山",
                            
                        },
                        {
                            "code": 86413545,
                            "name": "二仙桥",
                            
                        },
                        {
                            "code": 6442,
                            "name": "洪河",
                            
                        },
                        {
                            "code": 37283603,
                            "name": "航天",
                            
                        },
                        {
                            "code": 81037368,
                            "name": "建材路",
                            
                        },
                        {
                            "code": 81901964,
                            "name": "客运总站",
                            
                        },
                        {
                            "code": 35473220,
                            "name": "洛带古镇",
                            
                        },
                        {
                            "code": 537,
                            "name": "龙泉",
                            
                        },
                        {
                            "code": 35350686,
                            "name": "师大现代花园",
                            
                        },
                        {
                            "code": 2971,
                            "name": "十陵",
                            
                        },
                        {
                            "code": 81118915,
                            "name": "世茂城",
                            
                        },
                        {
                            "code": 7122,
                            "name": "同安",
                            
                        },
                        {
                            "code": 34685688,
                            "name": "西河镇",
                            
                        },
                        {
                            "code": 34685822,
                            "name": "阳光城",
                            
                        },
                        {
                            "code": 81323169,
                            "name": "音乐广场",
                            
                        }
                    ]
                },
                {
                    "code": 510121,
                    "name": "金堂县",
                    "subLevelModelList": [
                        {
                            "code": 35767594,
                            "name": "车站",
                            
                        },
                        {
                            "code": 35483029,
                            "name": "大学城",
                            
                        },
                        {
                            "code": 3694,
                            "name": "淮口",
                            
                        },
                        {
                            "code": 56481046,
                            "name": "金海岸耍都",
                            
                        },
                        {
                            "code": 3652,
                            "name": "竹篙",
                            
                        }
                    ]
                },
                {
                    "code": 510185,
                    "name": "简阳市",
                    "subLevelModelList": [
                        {
                            "code": 35431000,
                            "name": "河东新区",
                            
                        },
                        {
                            "code": 35419476,
                            "name": "贾家镇",
                            
                        },
                        {
                            "code": 35635190,
                            "name": "老城区",
                            
                        },
                        {
                            "code": 37129868,
                            "name": "三岔湖景区",
                            
                        },
                        {
                            "code": 71599836,
                            "name": "石盘镇",
                            
                        },
                        {
                            "code": 69518586,
                            "name": "石桥镇",
                            
                        },
                        {
                            "code": 74701713,
                            "name": "太平桥镇",
                            
                        },
                        {
                            "code": 92071020,
                            "name": "周克芹故里",
                            
                        }
                    ]
                },
                {
                    "code": 510184,
                    "name": "崇州市",
                    "subLevelModelList": [
                        {
                            "code": 38785763,
                            "name": "滨河路北段",
                            
                        },
                        {
                            "code": 2931,
                            "name": "崇阳",
                            
                        },
                        {
                            "code": 34602117,
                            "name": "崇州万达广场",
                            
                        },
                        {
                            "code": 37706972,
                            "name": "大划",
                            
                        },
                        {
                            "code": 34573143,
                            "name": "金鸡",
                            
                        },
                        {
                            "code": 8598,
                            "name": "街子",
                            
                        },
                        {
                            "code": 36335146,
                            "name": "桤泉",
                            
                        },
                        {
                            "code": 35320751,
                            "name": "三江",
                            
                        },
                        {
                            "code": 34795345,
                            "name": "唐人街",
                            
                        },
                        {
                            "code": 36184217,
                            "name": "羊马",
                            
                        }
                    ]
                },
                {
                    "code": 510132,
                    "name": "新津区",
                    
                },
                {
                    "code": 510131,
                    "name": "蒲江县",
                    "subLevelModelList": [
                        {
                            "code": 70114693,
                            "name": "成佳",
                            
                        },
                        {
                            "code": 38907598,
                            "name": "大溪谷",
                            
                        },
                        {
                            "code": 3213,
                            "name": "鹤山",
                            
                        },
                        {
                            "code": 81207472,
                            "name": "世纪广场",
                            
                        },
                        {
                            "code": 127793753,
                            "name": "西来镇",
                            
                        },
                        {
                            "code": 54497500,
                            "name": "星美国际影城",
                            
                        }
                    ]
                },
                {
                    "code": 510129,
                    "name": "大邑县",
                    "subLevelModelList": [
                        {
                            "code": 82810609,
                            "name": "安仁古镇",
                            
                        },
                        {
                            "code": 81192796,
                            "name": "蔡场镇",
                            
                        },
                        {
                            "code": 8569,
                            "name": "董场",
                            
                        },
                        {
                            "code": 35370141,
                            "name": "红光小区",
                            
                        },
                        {
                            "code": 34714207,
                            "name": "家乐福",
                            
                        },
                        {
                            "code": 709,
                            "name": "晋原",
                            
                        },
                        {
                            "code": 37978211,
                            "name": "潘家街",
                            
                        },
                        {
                            "code": 47458517,
                            "name": "新世纪广场",
                            
                        }
                    ]
                }
            ]
}