citys ={
    "chengdu":101270100,
    "beijing":101010100,
    "chongqing":101040100,
    "shenzhen":101280600,
    "guangzhou":101280100,
}
city_info = {
        "chengdu": [
                {
                    "code": 510108,
                    "name": "成华区",
                    "subLevelModelList": [
                        {
                            "code": 83677937,
                            "name": "339购物中心",
                            
                        },
                        {
                            "code": 92628903,
                            "name": "半边街",
                            
                        },
                        {
                            "code": 2015,
                            "name": "保和",
                            
                        },
                        {
                            "code": 37714945,
                            "name": "八里小区",
                            
                        },
                        {
                            "code": 5757,
                            "name": "八里庄",
                            
                        },
                        {
                            "code": 34621939,
                            "name": "成都东站",
                            
                        },
                        {
                            "code": 82977847,
                            "name": "成都理工",
                            
                        },
                        {
                            "code": 34624304,
                            "name": "财富又一城",
                            
                        },
                        {
                            "code": 55945694,
                            "name": "成渝立交",
                            
                        },
                        {
                            "code": 34572311,
                            "name": "东郊记忆",
                            
                        },
                        {
                            "code": 49300331,
                            "name": "东客站",
                            
                        },
                        {
                            "code": 34570718,
                            "name": "动物园",
                            
                        },
                        {
                            "code": 82240854,
                            "name": "电子科技大学",
                            
                        },
                        {
                            "code": 3703,
                            "name": "二仙桥",
                            
                        },
                        {
                            "code": 62903253,
                            "name": "府青路",
                            
                        },
                        {
                            "code": 81787636,
                            "name": "高笋塘",
                            
                        },
                        {
                            "code": 38795141,
                            "name": "火车北站",
                            
                        },
                        {
                            "code": 82682110,
                            "name": "火车东站",
                            
                        },
                        {
                            "code": 34736875,
                            "name": "红星路",
                            
                        },
                        {
                            "code": 428,
                            "name": "建设路",
                            
                        },
                        {
                            "code": 55519752,
                            "name": "凯德广场",
                            
                        },
                        {
                            "code": 48664133,
                            "name": "理工大",
                            
                        },
                        {
                            "code": 62612252,
                            "name": "龙湖三千集",
                            
                        },
                        {
                            "code": 1737,
                            "name": "李家沱",
                            
                        },
                        {
                            "code": 1174,
                            "name": "龙潭",
                            
                        },
                        {
                            "code": 575,
                            "name": "猛追湾",
                            
                        },
                        {
                            "code": 7125,
                            "name": "牛王庙",
                            
                        },
                        {
                            "code": 1558,
                            "name": "青龙场",
                            
                        },
                        {
                            "code": 3351,
                            "name": "圣灯",
                            
                        },
                        {
                            "code": 82495933,
                            "name": "双荆路",
                            
                        },
                        {
                            "code": 10553,
                            "name": "十陵",
                            
                        },
                        {
                            "code": 34598024,
                            "name": "十里店",
                            
                        },
                        {
                            "code": 3036,
                            "name": "双林路",
                            
                        },
                        {
                            "code": 34573636,
                            "name": "SM广场",
                            
                        },
                        {
                            "code": 40,
                            "name": "驷马桥",
                            
                        },
                        {
                            "code": 82129914,
                            "name": "水碾河",
                            
                        },
                        {
                            "code": 2881,
                            "name": "双桥子",
                            
                        },
                        {
                            "code": 62904144,
                            "name": "双水碾",
                            
                        },
                        {
                            "code": 62905611,
                            "name": "跳蹬河",
                            
                        },
                        {
                            "code": 62918977,
                            "name": "桃蹊路",
                            
                        },
                        {
                            "code": 83529957,
                            "name": "五桂桥",
                            
                        },
                        {
                            "code": 34793983,
                            "name": "五块石",
                            
                        },
                        {
                            "code": 742,
                            "name": "万年场",
                            
                        },
                        {
                            "code": 34572859,
                            "name": "万象城",
                            
                        },
                        {
                            "code": 34970849,
                            "name": "新华公园",
                            
                        },
                        {
                            "code": 3720,
                            "name": "新鸿路",
                            
                        },
                        {
                            "code": 35618652,
                            "name": "熊猫基地",
                            
                        }
                    ]
                },
                {
                    "code": 510107,
                    "name": "武侯区",
                    "subLevelModelList": [
                        {
                            "code": 34591773,
                            "name": "保利花园",
                            
                        },
                        {
                            "code": 34576062,
                            "name": "川大",
                            
                        },
                        {
                            "code": 48731438,
                            "name": "草金立交",
                            
                        },
                        {
                            "code": 2145,
                            "name": "簇桥",
                            
                        },
                        {
                            "code": 49202359,
                            "name": "川音",
                            
                        },
                        {
                            "code": 840,
                            "name": "创业路",
                            
                        },
                        {
                            "code": 6124,
                            "name": "东坡",
                            
                        },
                        {
                            "code": 81900774,
                            "name": "大石西路",
                            
                        },
                        {
                            "code": 85244368,
                            "name": "电信路",
                            
                        },
                        {
                            "code": 48626158,
                            "name": "大源",
                            
                        },
                        {
                            "code": 34568893,
                            "name": "复城国际广场",
                            
                        },
                        {
                            "code": 99289100,
                            "name": "芳草街",
                            
                        },
                        {
                            "code": 34569845,
                            "name": "孵化园",
                            
                        },
                        {
                            "code": 222876563,
                            "name": "高朋大道",
                            
                        },
                        {
                            "code": 1403,
                            "name": "高升桥",
                            
                        },
                        {
                            "code": 2046,
                            "name": "桂溪",
                            
                        },
                        {
                            "code": 90676890,
                            "name": "河滨路",
                            
                        },
                        {
                            "code": 707,
                            "name": "火车南站",
                            
                        },
                        {
                            "code": 34570574,
                            "name": "汇锦城",
                            
                        },
                        {
                            "code": 49237454,
                            "name": "航空港",
                            
                        },
                        {
                            "code": 34591202,
                            "name": "航空路",
                            
                        },
                        {
                            "code": 336,
                            "name": "红牌楼",
                            
                        },
                        {
                            "code": 34570802,
                            "name": "环球中心",
                            
                        },
                        {
                            "code": 56259882,
                            "name": "红瓦寺",
                            
                        },
                        {
                            "code": 34602969,
                            "name": "华西",
                            
                        },
                        {
                            "code": 34575133,
                            "name": "九方购物中心",
                            
                        },
                        {
                            "code": 34591616,
                            "name": "金花",
                            
                        },
                        {
                            "code": 38865634,
                            "name": "金融城",
                            
                        },
                        {
                            "code": 34566586,
                            "name": "机投",
                            
                        },
                        {
                            "code": 1875,
                            "name": "浆洗街",
                            
                        },
                        {
                            "code": 294,
                            "name": "九眼桥",
                            
                        },
                        {
                            "code": 192,
                            "name": "科华北路",
                            
                        },
                        {
                            "code": 69362694,
                            "name": "科华中路",
                            
                        },
                        {
                            "code": 82097991,
                            "name": "科华中路王府井",
                            
                        },
                        {
                            "code": 37750103,
                            "name": "丽都",
                            
                        },
                        {
                            "code": 34935134,
                            "name": "鹭岛国际",
                            
                        },
                        {
                            "code": 35681497,
                            "name": "龙湖金楠天街",
                            
                        },
                        {
                            "code": 39049038,
                            "name": "龙腾路",
                            
                        },
                        {
                            "code": 2200,
                            "name": "磨子桥",
                            
                        },
                        {
                            "code": 82802594,
                            "name": "清水河公园",
                            
                        },
                        {
                            "code": 6080,
                            "name": "青羊大道",
                            
                        },
                        {
                            "code": 104461781,
                            "name": "燃灯寺",
                            
                        },
                        {
                            "code": 64474363,
                            "name": "世豪广场",
                            
                        },
                        {
                            "code": 693,
                            "name": "双楠",
                            
                        },
                        {
                            "code": 37954761,
                            "name": "省体育馆",
                            
                        },
                        {
                            "code": 1232,
                            "name": "神仙树",
                            
                        },
                        {
                            "code": 34566431,
                            "name": "石羊场",
                            
                        },
                        {
                            "code": 49896965,
                            "name": "市一医院",
                            
                        },
                        {
                            "code": 34611795,
                            "name": "天府长城",
                            
                        },
                        {
                            "code": 67505180,
                            "name": "天府立交",
                            
                        },
                        {
                            "code": 1092,
                            "name": "跳伞塔",
                            
                        },
                        {
                            "code": 80953086,
                            "name": "铁像寺",
                            
                        },
                        {
                            "code": 1387,
                            "name": "桐梓林",
                            
                        },
                        {
                            "code": 34577227,
                            "name": "五大花园",
                            
                        },
                        {
                            "code": 1552,
                            "name": "武侯祠",
                            
                        },
                        {
                            "code": 48756633,
                            "name": "武侯立交",
                            
                        },
                        {
                            "code": 2866,
                            "name": "望江路",
                            
                        },
                        {
                            "code": 34583026,
                            "name": "外双楠",
                            
                        },
                        {
                            "code": 34566638,
                            "name": "新会展中心",
                            
                        },
                        {
                            "code": 1722,
                            "name": "肖家河",
                            
                        },
                        {
                            "code": 82182034,
                            "name": "洗面桥街",
                            
                        },
                        {
                            "code": 34610837,
                            "name": "新南门",
                            
                        },
                        {
                            "code": 3063,
                            "name": "小天竺",
                            
                        },
                        {
                            "code": 83192153,
                            "name": "永丰路",
                            
                        },
                        {
                            "code": 57929030,
                            "name": "衣冠庙",
                            
                        },
                        {
                            "code": 930,
                            "name": "玉林",
                            
                        },
                        {
                            "code": 34569270,
                            "name": "伊藤",
                            
                        },
                        {
                            "code": 34566631,
                            "name": "银泰城",
                            
                        },
                        {
                            "code": 55895324,
                            "name": "棕北",
                            
                        },
                        {
                            "code": 6186,
                            "name": "中和",
                            
                        },
                        {
                            "code": 377,
                            "name": "紫荆",
                            
                        }
                    ]
                },
                {
                    "code": 510106,
                    "name": "金牛区",
                    "subLevelModelList": [
                        {
                            "code": 82241204,
                            "name": "白果林",
                            
                        },
                        {
                            "code": 81998786,
                            "name": "北门大桥",
                            
                        },
                        {
                            "code": 69066145,
                            "name": "成都军区总医院",
                            
                        },
                        {
                            "code": 983,
                            "name": "茶店子",
                            
                        },
                        {
                            "code": 2060,
                            "name": "城隍庙",
                            
                        },
                        {
                            "code": 82240569,
                            "name": "洞子口",
                            
                        },
                        {
                            "code": 489,
                            "name": "抚琴",
                            
                        },
                        {
                            "code": 34586746,
                            "name": "国宾",
                            
                        },
                        {
                            "code": 34884638,
                            "name": "高家庄",
                            
                        },
                        {
                            "code": 81866168,
                            "name": "高笋塘",
                            
                        },
                        {
                            "code": 34591389,
                            "name": "火车北站",
                            
                        },
                        {
                            "code": 34584168,
                            "name": "荷花池",
                            
                        },
                        {
                            "code": 34634030,
                            "name": "欢乐谷",
                            
                        },
                        {
                            "code": 34575832,
                            "name": "花牌坊",
                            
                        },
                        {
                            "code": 34656859,
                            "name": "华侨城",
                            
                        },
                        {
                            "code": 55558676,
                            "name": "花照壁",
                            
                        },
                        {
                            "code": 2728,
                            "name": "交大路",
                            
                        },
                        {
                            "code": 81522179,
                            "name": "金府",
                            
                        },
                        {
                            "code": 6227,
                            "name": "解放路",
                            
                        },
                        {
                            "code": 2877,
                            "name": "九里堤",
                            
                        },
                        {
                            "code": 34577867,
                            "name": "金牛万达",
                            
                        },
                        {
                            "code": 798,
                            "name": "金泉",
                            
                        },
                        {
                            "code": 1975,
                            "name": "金沙",
                            
                        },
                        {
                            "code": 82380747,
                            "name": "凯德广场·金牛",
                            
                        },
                        {
                            "code": 5865,
                            "name": "李家沱",
                            
                        },
                        {
                            "code": 2202,
                            "name": "梁家巷",
                            
                        },
                        {
                            "code": 49925660,
                            "name": "马鞍路",
                            
                        },
                        {
                            "code": 829,
                            "name": "人民北路",
                            
                        },
                        {
                            "code": 1626,
                            "name": "蜀汉路",
                            
                        },
                        {
                            "code": 2686,
                            "name": "沙河源",
                            
                        },
                        {
                            "code": 2919,
                            "name": "驷马桥",
                            
                        },
                        {
                            "code": 63906585,
                            "name": "石人小区",
                            
                        },
                        {
                            "code": 592,
                            "name": "沙湾",
                            
                        },
                        {
                            "code": 3135,
                            "name": "天回",
                            
                        },
                        {
                            "code": 51153958,
                            "name": "通惠门",
                            
                        },
                        {
                            "code": 34571366,
                            "name": "五块石",
                            
                        },
                        {
                            "code": 34581705,
                            "name": "西安北路",
                            
                        },
                        {
                            "code": 763,
                            "name": "西南交大",
                            
                        },
                        {
                            "code": 82247971,
                            "name": "永陵路",
                            
                        },
                        {
                            "code": 1141,
                            "name": "营门口",
                            
                        },
                        {
                            "code": 34869799,
                            "name": "一品天下",
                            
                        },
                        {
                            "code": 34777693,
                            "name": "羊西线",
                            
                        },
                        {
                            "code": 34572998,
                            "name": "中海国际",
                            
                        },
                        {
                            "code": 95965507,
                            "name": "中医大省医院",
                            
                        }
                    ]
                },
                {
                    "code": 510105,
                    "name": "青羊区",
                    "subLevelModelList": [
                        {
                            "code": 1178,
                            "name": "八宝街",
                            
                        },
                        {
                            "code": 34590307,
                            "name": "贝森",
                            
                        },
                        {
                            "code": 34639367,
                            "name": "成飞大道",
                            
                        },
                        {
                            "code": 6629,
                            "name": "城隍庙",
                            
                        },
                        {
                            "code": 2283,
                            "name": "草市街",
                            
                        },
                        {
                            "code": 1269,
                            "name": "草堂",
                            
                        },
                        {
                            "code": 7105,
                            "name": "春熙路",
                            
                        },
                        {
                            "code": 471,
                            "name": "东坡",
                            
                        },
                        {
                            "code": 3436,
                            "name": "府南",
                            
                        },
                        {
                            "code": 6846,
                            "name": "抚琴",
                            
                        },
                        {
                            "code": 940,
                            "name": "光华",
                            
                        },
                        {
                            "code": 88475462,
                            "name": "光华大道",
                            
                        },
                        {
                            "code": 83473558,
                            "name": "浣花溪",
                            
                        },
                        {
                            "code": 617,
                            "name": "黄田坝",
                            
                        },
                        {
                            "code": 6851,
                            "name": "红星路",
                            
                        },
                        {
                            "code": 7689,
                            "name": "黄忠",
                            
                        },
                        {
                            "code": 1287,
                            "name": "金沙",
                            
                        },
                        {
                            "code": 34573913,
                            "name": "宽窄巷子",
                            
                        },
                        {
                            "code": 34613325,
                            "name": "骡马市",
                            
                        },
                        {
                            "code": 34583750,
                            "name": "鹏瑞利.青羊广场",
                            
                        },
                        {
                            "code": 1294,
                            "name": "清江",
                            
                        },
                        {
                            "code": 82483851,
                            "name": "清江东路",
                            
                        },
                        {
                            "code": 81766330,
                            "name": "清江西路",
                            
                        },
                        {
                            "code": 34870561,
                            "name": "琴台",
                            
                        },
                        {
                            "code": 1863,
                            "name": "青羊大道",
                            
                        },
                        {
                            "code": 34581649,
                            "name": "青羊宫",
                            
                        },
                        {
                            "code": 34571360,
                            "name": "青羊万达",
                            
                        },
                        {
                            "code": 34609944,
                            "name": "人民公园",
                            
                        },
                        {
                            "code": 2711,
                            "name": "蜀汉路",
                            
                        },
                        {
                            "code": 49162632,
                            "name": "苏坡",
                            
                        },
                        {
                            "code": 1157,
                            "name": "天府广场",
                            
                        },
                        {
                            "code": 82250024,
                            "name": "通锦桥",
                            
                        },
                        {
                            "code": 1325,
                            "name": "太升路",
                            
                        },
                        {
                            "code": 48194121,
                            "name": "外光华",
                            
                        },
                        {
                            "code": 1675,
                            "name": "文家",
                            
                        },
                        {
                            "code": 2172,
                            "name": "汪家拐",
                            
                        },
                        {
                            "code": 37327310,
                            "name": "外金沙",
                            
                        },
                        {
                            "code": 48818807,
                            "name": "万家湾",
                            
                        },
                        {
                            "code": 70996381,
                            "name": "文殊院",
                            
                        },
                        {
                            "code": 82378065,
                            "name": "西单商场",
                            
                        },
                        {
                            "code": 59894135,
                            "name": "西南财经大学",
                            
                        },
                        {
                            "code": 34743088,
                            "name": "优品道",
                            
                        },
                        {
                            "code": 1757,
                            "name": "盐市口",
                            
                        },
                        {
                            "code": 82812720,
                            "name": "中坝",
                            
                        }
                    ]
                },
                {
                    "code": 510104,
                    "name": "锦江区",
                    "subLevelModelList": [
                        {
                            "code": 61131275,
                            "name": "成龙路",
                            
                        },
                        {
                            "code": 34606674,
                            "name": "川师",
                            
                        },
                        {
                            "code": 733,
                            "name": "春熙路",
                            
                        },
                        {
                            "code": 64514578,
                            "name": "东大街",
                            
                        },
                        {
                            "code": 55808283,
                            "name": "东大路",
                            
                        },
                        {
                            "code": 102731945,
                            "name": "东风大桥",
                            
                        },
                        {
                            "code": 2643,
                            "name": "东光",
                            
                        },
                        {
                            "code": 56215769,
                            "name": "东湖",
                            
                        },
                        {
                            "code": 36952902,
                            "name": "火车南站",
                            
                        },
                        {
                            "code": 34637133,
                            "name": "海椒市",
                            
                        },
                        {
                            "code": 34576606,
                            "name": "合江亭",
                            
                        },
                        {
                            "code": 307,
                            "name": "红星路",
                            
                        },
                        {
                            "code": 82553185,
                            "name": "锦华万达",
                            
                        },
                        {
                            "code": 34606206,
                            "name": "静居寺",
                            
                        },
                        {
                            "code": 1042,
                            "name": "九眼桥",
                            
                        },
                        {
                            "code": 50081672,
                            "name": "蓝谷地",
                            
                        },
                        {
                            "code": 65224360,
                            "name": "兰桂坊",
                            
                        },
                        {
                            "code": 82950589,
                            "name": "莲桂路",
                            
                        },
                        {
                            "code": 34610675,
                            "name": "莲桂南路",
                            
                        },
                        {
                            "code": 54344243,
                            "name": "柳江",
                            
                        },
                        {
                            "code": 34577067,
                            "name": "琉璃场",
                            
                        },
                        {
                            "code": 62979504,
                            "name": "莲新",
                            
                        },
                        {
                            "code": 2835,
                            "name": "龙舟路",
                            
                        },
                        {
                            "code": 3264,
                            "name": "猛追湾",
                            
                        },
                        {
                            "code": 1027,
                            "name": "牛市口",
                            
                        },
                        {
                            "code": 1984,
                            "name": "牛王庙",
                            
                        },
                        {
                            "code": 49261907,
                            "name": "攀成钢",
                            
                        },
                        {
                            "code": 34591960,
                            "name": "四川师大",
                            
                        },
                        {
                            "code": 62913875,
                            "name": "双桂路",
                            
                        },
                        {
                            "code": 55860779,
                            "name": "三官堂",
                            
                        },
                        {
                            "code": 34585611,
                            "name": "沙河",
                            
                        },
                        {
                            "code": 34616917,
                            "name": "水碾河",
                            
                        },
                        {
                            "code": 921,
                            "name": "三圣",
                            
                        },
                        {
                            "code": 81016005,
                            "name": "三圣乡",
                            
                        },
                        {
                            "code": 62901914,
                            "name": "书院街",
                            
                        },
                        {
                            "code": 2342,
                            "name": "天府广场",
                            
                        },
                        {
                            "code": 82418113,
                            "name": "太古里",
                            
                        },
                        {
                            "code": 2628,
                            "name": "太升路",
                            
                        },
                        {
                            "code": 62568835,
                            "name": "塔子山公园",
                            
                        },
                        {
                            "code": 55553721,
                            "name": "万达广场",
                            
                        },
                        {
                            "code": 7456,
                            "name": "汪家拐",
                            
                        },
                        {
                            "code": 7074,
                            "name": "望江路",
                            
                        },
                        {
                            "code": 1135,
                            "name": "盐市口",
                            
                        },
                        {
                            "code": 48861030,
                            "name": "卓锦城",
                            
                        }
                    ]
                },
                {
                    "code": 510183,
                    "name": "邛崃市",
                    "subLevelModelList": [
                        {
                            "code": 93386331,
                            "name": "固驿镇",
                            
                        },
                        {
                            "code": 8592,
                            "name": "火井",
                            
                        },
                        {
                            "code": 66031776,
                            "name": "回龙",
                            
                        },
                        {
                            "code": 85223481,
                            "name": "金桂街",
                            
                        },
                        {
                            "code": 37628107,
                            "name": "君威广场",
                            
                        },
                        {
                            "code": 107700848,
                            "name": "临济",
                            
                        },
                        {
                            "code": 3249,
                            "name": "临邛",
                            
                        },
                        {
                            "code": 66237242,
                            "name": "牟礼村",
                            
                        },
                        {
                            "code": 97872577,
                            "name": "南宝山木梯羌寨",
                            
                        },
                        {
                            "code": 37937521,
                            "name": "女人街",
                            
                        },
                        {
                            "code": 90524608,
                            "name": "平乐古镇",
                            
                        },
                        {
                            "code": 36266546,
                            "name": "前进",
                            
                        },
                        {
                            "code": 82603477,
                            "name": "钱江凤凰城",
                            
                        },
                        {
                            "code": 82847376,
                            "name": "邛崃家乐福",
                            
                        },
                        {
                            "code": 104037001,
                            "name": "水口",
                            
                        },
                        {
                            "code": 8595,
                            "name": "天台山",
                            
                        },
                        {
                            "code": 7361,
                            "name": "羊安",
                            
                        }
                    ]
                },
                {
                    "code": 510182,
                    "name": "彭州市",
                    "subLevelModelList": [
                        {
                            "code": 7939,
                            "name": "安仁",
                            
                        },
                        {
                            "code": 84794329,
                            "name": "北大街",
                            
                        },
                        {
                            "code": 74990727,
                            "name": "白鹿镇",
                            
                        },
                        {
                            "code": 81559852,
                            "name": "朝阳中路",
                            
                        },
                        {
                            "code": 81522775,
                            "name": "丽春镇",
                            
                        },
                        {
                            "code": 37634349,
                            "name": "隆丰",
                            
                        },
                        {
                            "code": 35467229,
                            "name": "濛阳镇",
                            
                        },
                        {
                            "code": 35131547,
                            "name": "南部新城",
                            
                        },
                        {
                            "code": 81071707,
                            "name": "上柳河",
                            
                        },
                        {
                            "code": 55848804,
                            "name": "天彭街道",
                            
                        },
                        {
                            "code": 81172660,
                            "name": "天彭镇",
                            
                        },
                        {
                            "code": 82045972,
                            "name": "沃尔玛",
                            
                        },
                        {
                            "code": 81212636,
                            "name": "西华大学",
                            
                        },
                        {
                            "code": 125206188,
                            "name": "小鱼洞",
                            
                        },
                        {
                            "code": 6509,
                            "name": "致和",
                            
                        }
                    ]
                },
                {
                    "code": 510181,
                    "name": "都江堰市",
                    "subLevelModelList": [
                        {
                            "code": 42273345,
                            "name": "百伦广场",
                            
                        },
                        {
                            "code": 36839463,
                            "name": "柏条河",
                            
                        },
                        {
                            "code": 64523451,
                            "name": "北外街",
                            
                        },
                        {
                            "code": 7566,
                            "name": "大观",
                            
                        },
                        {
                            "code": 34769050,
                            "name": "都江堰快铁站",
                            
                        },
                        {
                            "code": 35500207,
                            "name": "都江堰市体育中心",
                            
                        },
                        {
                            "code": 37462286,
                            "name": "都江堰市中医医院",
                            
                        },
                        {
                            "code": 1672,
                            "name": "灌口",
                            
                        },
                        {
                            "code": 88708692,
                            "name": "花园",
                            
                        },
                        {
                            "code": 38913636,
                            "name": "金融中心",
                            
                        },
                        {
                            "code": 88423501,
                            "name": "九寨花苑",
                            
                        },
                        {
                            "code": 82428226,
                            "name": "蒲阳镇",
                            
                        },
                        {
                            "code": 51433104,
                            "name": "青城后山",
                            
                        },
                        {
                            "code": 5892,
                            "name": "青城山",
                            
                        },
                        {
                            "code": 82720230,
                            "name": "天籁村",
                            
                        },
                        {
                            "code": 2773,
                            "name": "幸福",
                            
                        },
                        {
                            "code": 36564544,
                            "name": "学府路",
                            
                        },
                        {
                            "code": 84286341,
                            "name": "新马路",
                            
                        },
                        {
                            "code": 35355531,
                            "name": "壹街区",
                            
                        },
                        {
                            "code": 77815865,
                            "name": "玉垒山公园",
                            
                        },
                        {
                            "code": 7489,
                            "name": "玉堂",
                            
                        },
                        {
                            "code": 82522126,
                            "name": "中兴镇",
                            
                        }
                    ]
                },
                {
                    "code": 510117,
                    "name": "郫都区",
                    "subLevelModelList": [
                        {
                            "code": 81439746,
                            "name": "安德镇",
                            
                        },
                        {
                            "code": 10265,
                            "name": "安靖",
                            
                        },
                        {
                            "code": 35055043,
                            "name": "成外",
                            
                        },
                        {
                            "code": 10557,
                            "name": "大丰",
                            
                        },
                        {
                            "code": 81229537,
                            "name": "德源镇",
                            
                        },
                        {
                            "code": 34593689,
                            "name": "高新西",
                            
                        },
                        {
                            "code": 10245,
                            "name": "红光镇",
                            
                        },
                        {
                            "code": 35568613,
                            "name": "合能四季城",
                            
                        },
                        {
                            "code": 10253,
                            "name": "郫筒",
                            
                        },
                        {
                            "code": 80983355,
                            "name": "郫县城区",
                            
                        },
                        {
                            "code": 81141574,
                            "name": "郫县万达",
                            
                        },
                        {
                            "code": 36148545,
                            "name": "蜀都万达",
                            
                        },
                        {
                            "code": 10500,
                            "name": "三道堰",
                            
                        },
                        {
                            "code": 53604181,
                            "name": "唐昌",
                            
                        },
                        {
                            "code": 10287,
                            "name": "团结",
                            
                        },
                        {
                            "code": 70612282,
                            "name": "新民场",
                            
                        },
                        {
                            "code": 10248,
                            "name": "犀浦",
                            
                        },
                        {
                            "code": 85010163,
                            "name": "橡树湾",
                            
                        },
                        {
                            "code": 83787004,
                            "name": "友爱镇",
                            
                        },
                        {
                            "code": 34608534,
                            "name": "中海国际",
                            
                        }
                    ]
                },
                {
                    "code": 510116,
                    "name": "双流区",
                    "subLevelModelList": [
                        {
                            "code": 35028622,
                            "name": "奥特莱斯",
                            
                        },
                        {
                            "code": 1529,
                            "name": "白家",
                            
                        },
                        {
                            "code": 81628926,
                            "name": "白沙镇",
                            
                        },
                        {
                            "code": 222885774,
                            "name": "成都高新区",
                            
                        },
                        {
                            "code": 64274219,
                            "name": "城南优品道广场",
                            
                        },
                        {
                            "code": 1911,
                            "name": "东升",
                            
                        },
                        {
                            "code": 35790242,
                            "name": "广都",
                            
                        },
                        {
                            "code": 108937017,
                            "name": "钢铁镇",
                            
                        },
                        {
                            "code": 1723,
                            "name": "公兴",
                            
                        },
                        {
                            "code": 81191893,
                            "name": "海滨城",
                            
                        },
                        {
                            "code": 34593504,
                            "name": "华府",
                            
                        },
                        {
                            "code": 3011,
                            "name": "黄甲",
                            
                        },
                        {
                            "code": 35208763,
                            "name": "航空港",
                            
                        },
                        {
                            "code": 3239,
                            "name": "黄龙溪",
                            
                        },
                        {
                            "code": 6547,
                            "name": "黄水",
                            
                        },
                        {
                            "code": 1113,
                            "name": "华阳",
                            
                        },
                        {
                            "code": 35108488,
                            "name": "海洋公园",
                            
                        },
                        {
                            "code": 2333,
                            "name": "九江",
                            
                        },
                        {
                            "code": 34569505,
                            "name": "蛟龙港",
                            
                        },
                        {
                            "code": 34615200,
                            "name": "九龙湖",
                            
                        },
                        {
                            "code": 82695959,
                            "name": "戛纳湾",
                            
                        },
                        {
                            "code": 6863,
                            "name": "金桥",
                            
                        },
                        {
                            "code": 82697264,
                            "name": "籍田街道",
                            
                        },
                        {
                            "code": 48417842,
                            "name": "警院",
                            
                        },
                        {
                            "code": 35001383,
                            "name": "麓湖生态城",
                            
                        },
                        {
                            "code": 34571450,
                            "name": "麓山",
                            
                        },
                        {
                            "code": 34578507,
                            "name": "牧马山",
                            
                        },
                        {
                            "code": 35944563,
                            "name": "南湖",
                            
                        },
                        {
                            "code": 58616280,
                            "name": "仁寿",
                            
                        },
                        {
                            "code": 71861894,
                            "name": "四川大学江安校区",
                            
                        },
                        {
                            "code": 34600925,
                            "name": "四川现代职业学院",
                            
                        },
                        {
                            "code": 37728402,
                            "name": "双流城区",
                            
                        },
                        {
                            "code": 34570678,
                            "name": "双流机场",
                            
                        },
                        {
                            "code": 81172073,
                            "name": "双流万达",
                            
                        },
                        {
                            "code": 222885772,
                            "name": "天府新区",
                            
                        },
                        {
                            "code": 62965686,
                            "name": "万安",
                            
                        },
                        {
                            "code": 2927,
                            "name": "文星",
                            
                        },
                        {
                            "code": 81112448,
                            "name": "兴隆街道",
                            
                        },
                        {
                            "code": 7287,
                            "name": "新兴",
                            
                        },
                        {
                            "code": 84913291,
                            "name": "永安镇",
                            
                        },
                        {
                            "code": 48712795,
                            "name": "远大",
                            
                        },
                        {
                            "code": 67879356,
                            "name": "雅居乐",
                            
                        },
                        {
                            "code": 84821709,
                            "name": "永兴街道",
                            
                        },
                        {
                            "code": 72382490,
                            "name": "益州国际广场",
                            
                        },
                        {
                            "code": 35166547,
                            "name": "中德",
                            
                        },
                        {
                            "code": 1647,
                            "name": "中和",
                            
                        },
                        {
                            "code": 7393,
                            "name": "正兴",
                            
                        }
                    ]
                },
                {
                    "code": 510115,
                    "name": "温江区",
                    "subLevelModelList": [
                        {
                            "code": 82750094,
                            "name": "成都师范学院温江校区",
                            
                        },
                        {
                            "code": 55346786,
                            "name": "凤凰大街",
                            
                        },
                        {
                            "code": 34578206,
                            "name": "芙蓉古城",
                            
                        },
                        {
                            "code": 81288036,
                            "name": "凤溪大道",
                            
                        },
                        {
                            "code": 67150370,
                            "name": "光华大道",
                            
                        },
                        {
                            "code": 6057,
                            "name": "公平",
                            
                        },
                        {
                            "code": 34592326,
                            "name": "国色天乡",
                            
                        },
                        {
                            "code": 34571340,
                            "name": "花都大道",
                            
                        },
                        {
                            "code": 87155443,
                            "name": "花园",
                            
                        },
                        {
                            "code": 1137,
                            "name": "金马镇",
                            
                        },
                        {
                            "code": 15,
                            "name": "柳城",
                            
                        },
                        {
                            "code": 82901519,
                            "name": "柳浪湾",
                            
                        },
                        {
                            "code": 82731012,
                            "name": "四川农业大学",
                            
                        },
                        {
                            "code": 46443775,
                            "name": "四川艺术职业学院温江校区",
                            
                        },
                        {
                            "code": 83380531,
                            "name": "泰迪熊博物馆",
                            
                        },
                        {
                            "code": 2824,
                            "name": "天府",
                            
                        },
                        {
                            "code": 1664,
                            "name": "万春",
                            
                        },
                        {
                            "code": 7285,
                            "name": "文家",
                            
                        },
                        {
                            "code": 34569964,
                            "name": "温江大学城",
                            
                        },
                        {
                            "code": 82582200,
                            "name": "温江老城",
                            
                        },
                        {
                            "code": 50262577,
                            "name": "温江新城",
                            
                        },
                        {
                            "code": 87550595,
                            "name": "温江校区",
                            
                        },
                        {
                            "code": 81947850,
                            "name": "永宁镇",
                            
                        },
                        {
                            "code": 1718,
                            "name": "涌泉",
                            
                        },
                        {
                            "code": 34572738,
                            "name": "珠江国际",
                            
                        },
                        {
                            "code": 49719871,
                            "name": "珠江新城",
                            
                        }
                    ]
                },
                {
                    "code": 510114,
                    "name": "新都区",
                    "subLevelModelList": [
                        {
                            "code": 57727960,
                            "name": "缤纷时代广场",
                            
                        },
                        {
                            "code": 57867914,
                            "name": "宝光寺",
                            
                        },
                        {
                            "code": 35247499,
                            "name": "保利公园",
                            
                        },
                        {
                            "code": 1962,
                            "name": "斑竹园",
                            
                        },
                        {
                            "code": 1270,
                            "name": "大丰",
                            
                        },
                        {
                            "code": 58271457,
                            "name": "电子路",
                            
                        },
                        {
                            "code": 82235449,
                            "name": "桂湖",
                            
                        },
                        {
                            "code": 81925905,
                            "name": "静安路",
                            
                        },
                        {
                            "code": 2021,
                            "name": "龙桥",
                            
                        },
                        {
                            "code": 81193684,
                            "name": "木兰山",
                            
                        },
                        {
                            "code": 35674414,
                            "name": "毗河",
                            
                        },
                        {
                            "code": 111630300,
                            "name": "青白江",
                            
                        },
                        {
                            "code": 7445,
                            "name": "石板滩",
                            
                        },
                        {
                            "code": 34615060,
                            "name": "四川音乐学院",
                            
                        },
                        {
                            "code": 2365,
                            "name": "三河",
                            
                        },
                        {
                            "code": 3489,
                            "name": "天回",
                            
                        },
                        {
                            "code": 81520953,
                            "name": "泰兴镇",
                            
                        },
                        {
                            "code": 57448183,
                            "name": "天缘路",
                            
                        },
                        {
                            "code": 81301364,
                            "name": "体育森林公园",
                            
                        },
                        {
                            "code": 80988817,
                            "name": "新都城区",
                            
                        },
                        {
                            "code": 81026816,
                            "name": "新都物流基地",
                            
                        },
                        {
                            "code": 2598,
                            "name": "新繁",
                            
                        },
                        {
                            "code": 35681482,
                            "name": "新民镇",
                            
                        },
                        {
                            "code": 35077752,
                            "name": "西南石油大学",
                            
                        }
                    ]
                },
                {
                    "code": 510113,
                    "name": "青白江区",
                    "subLevelModelList": [
                        {
                            "code": 5914,
                            "name": "大弯",
                            
                        },
                        {
                            "code": 5959,
                            "name": "红阳",
                            
                        },
                        {
                            "code": 34571661,
                            "name": "幸福家园",
                            
                        }
                    ]
                },
                {
                    "code": 510112,
                    "name": "龙泉驿区",
                    "subLevelModelList": [
                        {
                            "code": 83133758,
                            "name": "半边街",
                            
                        },
                        {
                            "code": 35376169,
                            "name": "柏合镇",
                            
                        },
                        {
                            "code": 35163557,
                            "name": "北泉路",
                            
                        },
                        {
                            "code": 82727209,
                            "name": "成龙路",
                            
                        },
                        {
                            "code": 67495848,
                            "name": "成渝立交",
                            
                        },
                        {
                            "code": 2616,
                            "name": "大面",
                            
                        },
                        {
                            "code": 34577373,
                            "name": "东山",
                            
                        },
                        {
                            "code": 86413545,
                            "name": "二仙桥",
                            
                        },
                        {
                            "code": 6442,
                            "name": "洪河",
                            
                        },
                        {
                            "code": 37283603,
                            "name": "航天",
                            
                        },
                        {
                            "code": 81037368,
                            "name": "建材路",
                            
                        },
                        {
                            "code": 81901964,
                            "name": "客运总站",
                            
                        },
                        {
                            "code": 35473220,
                            "name": "洛带古镇",
                            
                        },
                        {
                            "code": 537,
                            "name": "龙泉",
                            
                        },
                        {
                            "code": 35350686,
                            "name": "师大现代花园",
                            
                        },
                        {
                            "code": 2971,
                            "name": "十陵",
                            
                        },
                        {
                            "code": 81118915,
                            "name": "世茂城",
                            
                        },
                        {
                            "code": 7122,
                            "name": "同安",
                            
                        },
                        {
                            "code": 34685688,
                            "name": "西河镇",
                            
                        },
                        {
                            "code": 34685822,
                            "name": "阳光城",
                            
                        },
                        {
                            "code": 81323169,
                            "name": "音乐广场",
                            
                        }
                    ]
                },
                {
                    "code": 510121,
                    "name": "金堂县",
                    "subLevelModelList": [
                        {
                            "code": 35767594,
                            "name": "车站",
                            
                        },
                        {
                            "code": 35483029,
                            "name": "大学城",
                            
                        },
                        {
                            "code": 3694,
                            "name": "淮口",
                            
                        },
                        {
                            "code": 56481046,
                            "name": "金海岸耍都",
                            
                        },
                        {
                            "code": 3652,
                            "name": "竹篙",
                            
                        }
                    ]
                },
                {
                    "code": 510185,
                    "name": "简阳市",
                    "subLevelModelList": [
                        {
                            "code": 35431000,
                            "name": "河东新区",
                            
                        },
                        {
                            "code": 35419476,
                            "name": "贾家镇",
                            
                        },
                        {
                            "code": 35635190,
                            "name": "老城区",
                            
                        },
                        {
                            "code": 37129868,
                            "name": "三岔湖景区",
                            
                        },
                        {
                            "code": 71599836,
                            "name": "石盘镇",
                            
                        },
                        {
                            "code": 69518586,
                            "name": "石桥镇",
                            
                        },
                        {
                            "code": 74701713,
                            "name": "太平桥镇",
                            
                        },
                        {
                            "code": 92071020,
                            "name": "周克芹故里",
                            
                        }
                    ]
                },
                {
                    "code": 510184,
                    "name": "崇州市",
                    "subLevelModelList": [
                        {
                            "code": 38785763,
                            "name": "滨河路北段",
                            
                        },
                        {
                            "code": 2931,
                            "name": "崇阳",
                            
                        },
                        {
                            "code": 34602117,
                            "name": "崇州万达广场",
                            
                        },
                        {
                            "code": 37706972,
                            "name": "大划",
                            
                        },
                        {
                            "code": 34573143,
                            "name": "金鸡",
                            
                        },
                        {
                            "code": 8598,
                            "name": "街子",
                            
                        },
                        {
                            "code": 36335146,
                            "name": "桤泉",
                            
                        },
                        {
                            "code": 35320751,
                            "name": "三江",
                            
                        },
                        {
                            "code": 34795345,
                            "name": "唐人街",
                            
                        },
                        {
                            "code": 36184217,
                            "name": "羊马",
                            
                        }
                    ]
                },
                {
                    "code": 510132,
                    "name": "新津区",
                    
                },
                {
                    "code": 510131,
                    "name": "蒲江县",
                    "subLevelModelList": [
                        {
                            "code": 70114693,
                            "name": "成佳",
                            
                        },
                        {
                            "code": 38907598,
                            "name": "大溪谷",
                            
                        },
                        {
                            "code": 3213,
                            "name": "鹤山",
                            
                        },
                        {
                            "code": 81207472,
                            "name": "世纪广场",
                            
                        },
                        {
                            "code": 127793753,
                            "name": "西来镇",
                            
                        },
                        {
                            "code": 54497500,
                            "name": "星美国际影城",
                            
                        }
                    ]
                },
                {
                    "code": 510129,
                    "name": "大邑县",
                    "subLevelModelList": [
                        {
                            "code": 82810609,
                            "name": "安仁古镇",
                            
                        },
                        {
                            "code": 81192796,
                            "name": "蔡场镇",
                            
                        },
                        {
                            "code": 8569,
                            "name": "董场",
                            
                        },
                        {
                            "code": 35370141,
                            "name": "红光小区",
                            
                        },
                        {
                            "code": 34714207,
                            "name": "家乐福",
                            
                        },
                        {
                            "code": 709,
                            "name": "晋原",
                            
                        },
                        {
                            "code": 37978211,
                            "name": "潘家街",
                            
                        },
                        {
                            "code": 47458517,
                            "name": "新世纪广场",
                            
                        }
                    ]
                }
            ],
        "beijing": [
                {
                    "code": 110101,
                    "name": "东城区",
                    "subLevelModelList": [
                        {
                            "code": 265,
                            "name": "安定门",

                        },
                        {
                            "code": 414,
                            "name": "安贞",

                        },
                        {
                            "code": 36,
                            "name": "北京站",

                        },
                        {
                            "code": 1086,
                            "name": "北新桥",

                        },
                        {
                            "code": 698,
                            "name": "磁器口",

                        },
                        {
                            "code": 876,
                            "name": "崇文门",

                        },
                        {
                            "code": 84,
                            "name": "朝阳门",

                        },
                        {
                            "code": 127,
                            "name": "东单",

                        },
                        {
                            "code": 43,
                            "name": "东四",

                        },
                        {
                            "code": 7579,
                            "name": "灯市口",

                        },
                        {
                            "code": 64,
                            "name": "东直门",

                        },
                        {
                            "code": 82877928,
                            "name": "簋街",

                        },
                        {
                            "code": 1226,
                            "name": "光明楼",

                        },
                        {
                            "code": 284,
                            "name": "广渠门",

                        },
                        {
                            "code": 47,
                            "name": "工体",

                        },
                        {
                            "code": 144,
                            "name": "和平里",

                        },
                        {
                            "code": 101708817,
                            "name": "黄寺",

                        },
                        {
                            "code": 1,
                            "name": "交道口",

                        },
                        {
                            "code": 83949803,
                            "name": "建国门内",

                        },
                        {
                            "code": 3700,
                            "name": "劲松",

                        },
                        {
                            "code": 7536,
                            "name": "柳芳",

                        },
                        {
                            "code": 7381,
                            "name": "刘家窑",

                        },
                        {
                            "code": 85047343,
                            "name": "龙潭湖",

                        },
                        {
                            "code": 84119927,
                            "name": "马家堡",

                        },
                        {
                            "code": 83566306,
                            "name": "美术馆",

                        },
                        {
                            "code": 7860,
                            "name": "木樨园",

                        },
                        {
                            "code": 50445945,
                            "name": "南锣鼓巷",

                        },
                        {
                            "code": 7640,
                            "name": "蒲黄榆",

                        },
                        {
                            "code": 449,
                            "name": "前门",

                        },
                        {
                            "code": 35038714,
                            "name": "什刹海",

                        },
                        {
                            "code": 3121,
                            "name": "双井",

                        },
                        {
                            "code": 2554,
                            "name": "三里屯",

                        },
                        {
                            "code": 7563,
                            "name": "沙滩",

                        },
                        {
                            "code": 1915,
                            "name": "沙子口",

                        },
                        {
                            "code": 7749,
                            "name": "天桥",

                        },
                        {
                            "code": 401,
                            "name": "天坛",

                        },
                        {
                            "code": 1464,
                            "name": "体育馆路",

                        },
                        {
                            "code": 5,
                            "name": "王府井",

                        },
                        {
                            "code": 83742510,
                            "name": "新世界",

                        },
                        {
                            "code": 543,
                            "name": "永定门",

                        },
                        {
                            "code": 1071,
                            "name": "雍和宫",

                        },
                        {
                            "code": 34571382,
                            "name": "左安门",

                        },
                        {
                            "code": 2051,
                            "name": "左家庄",

                        },
                        {
                            "code": 50420311,
                            "name": "珠市口",

                        }
                    ]
                },
                {
                    "code": 110102,
                    "name": "西城区",
                    "subLevelModelList": [
                        {
                            "code": 47211294,
                            "name": "安定门",

                        },
                        {
                            "code": 87267479,
                            "name": "安华",

                        },
                        {
                            "code": 7103,
                            "name": "安贞",

                        },
                        {
                            "code": 82950876,
                            "name": "白广路",

                        },
                        {
                            "code": 50421200,
                            "name": "北京西站",

                        },
                        {
                            "code": 6586,
                            "name": "北太平庄",

                        },
                        {
                            "code": 7059,
                            "name": "百万庄",

                        },
                        {
                            "code": 1000,
                            "name": "白纸坊",

                        },
                        {
                            "code": 1437,
                            "name": "长椿街",

                        },
                        {
                            "code": 934,
                            "name": "车公庄",

                        },
                        {
                            "code": 1724,
                            "name": "菜市口",

                        },
                        {
                            "code": 2804,
                            "name": "地安门",

                        },
                        {
                            "code": 231,
                            "name": "德胜门",

                        },
                        {
                            "code": 264,
                            "name": "德外大街",

                        },
                        {
                            "code": 2884,
                            "name": "动物园",

                        },
                        {
                            "code": 49681752,
                            "name": "大栅栏",

                        },
                        {
                            "code": 1691,
                            "name": "阜成门",

                        },
                        {
                            "code": 133,
                            "name": "复兴门",

                        },
                        {
                            "code": 303,
                            "name": "广安门",

                        },
                        {
                            "code": 7609,
                            "name": "广内大街",

                        },
                        {
                            "code": 486,
                            "name": "广外大街",

                        },
                        {
                            "code": 557,
                            "name": "官园",

                        },
                        {
                            "code": 1491,
                            "name": "虎坊桥",

                        },
                        {
                            "code": 1227,
                            "name": "和平门",

                        },
                        {
                            "code": 82138763,
                            "name": "黄寺",

                        },
                        {
                            "code": 132,
                            "name": "金融街",

                        },
                        {
                            "code": 7636,
                            "name": "积水潭",

                        },
                        {
                            "code": 2149,
                            "name": "六铺炕",

                        },
                        {
                            "code": 379,
                            "name": "马甸",

                        },
                        {
                            "code": 50422765,
                            "name": "牡丹园",

                        },
                        {
                            "code": 242,
                            "name": "马连道",

                        },
                        {
                            "code": 3806,
                            "name": "木樨地",

                        },
                        {
                            "code": 1502,
                            "name": "牛街",

                        },
                        {
                            "code": 501,
                            "name": "南礼士路",

                        },
                        {
                            "code": 2405,
                            "name": "前门",

                        },
                        {
                            "code": 910,
                            "name": "什刹海",

                        },
                        {
                            "code": 846,
                            "name": "三里河",

                        },
                        {
                            "code": 85453187,
                            "name": "天安门广场",

                        },
                        {
                            "code": 35828051,
                            "name": "天宁寺",

                        },
                        {
                            "code": 2422,
                            "name": "天桥",

                        },
                        {
                            "code": 496,
                            "name": "陶然亭",

                        },
                        {
                            "code": 1700,
                            "name": "天坛",

                        },
                        {
                            "code": 7451,
                            "name": "西便门",

                        },
                        {
                            "code": 245,
                            "name": "西单",

                        },
                        {
                            "code": 856,
                            "name": "新街口",

                        },
                        {
                            "code": 7812,
                            "name": "西客站",

                        },
                        {
                            "code": 595,
                            "name": "西四",

                        },
                        {
                            "code": 382,
                            "name": "宣武门",

                        },
                        {
                            "code": 7809,
                            "name": "小西天",

                        },
                        {
                            "code": 114,
                            "name": "西直门",

                        },
                        {
                            "code": 96137257,
                            "name": "右安门",

                        },
                        {
                            "code": 83450990,
                            "name": "右安门内",

                        },
                        {
                            "code": 606,
                            "name": "月坛",

                        },
                        {
                            "code": 312,
                            "name": "展览路",

                        },
                        {
                            "code": 50422329,
                            "name": "珠市口",

                        }
                    ]
                },
                {
                    "code": 110105,
                    "name": "朝阳区",
                    "subLevelModelList": [
                        {
                            "code": 2730,
                            "name": "安定门",

                        },
                        {
                            "code": 83808828,
                            "name": "安华",

                        },
                        {
                            "code": 50020699,
                            "name": "奥林匹克公园",

                        },
                        {
                            "code": 412,
                            "name": "奥运村",

                        },
                        {
                            "code": 216,
                            "name": "安贞",

                        },
                        {
                            "code": 82204590,
                            "name": "北辰",

                        },
                        {
                            "code": 50597367,
                            "name": "北工大",

                        },
                        {
                            "code": 2525,
                            "name": "八里桥",

                        },
                        {
                            "code": 34585674,
                            "name": "八里庄",

                        },
                        {
                            "code": 2836,
                            "name": "北沙滩",

                        },
                        {
                            "code": 279,
                            "name": "百子湾",

                        },
                        {
                            "code": 259,
                            "name": "CBD",

                        },
                        {
                            "code": 50426305,
                            "name": "草房",

                        },
                        {
                            "code": 50420490,
                            "name": "传媒大学",

                        },
                        {
                            "code": 34769243,
                            "name": "朝青",

                        },
                        {
                            "code": 328,
                            "name": "成寿寺",

                        },
                        {
                            "code": 7,
                            "name": "朝外",

                        },
                        {
                            "code": 145,
                            "name": "常营",

                        },
                        {
                            "code": 34570568,
                            "name": "朝阳大悦城",

                        },
                        {
                            "code": 104,
                            "name": "朝阳公园",

                        },
                        {
                            "code": 7546,
                            "name": "朝阳门",

                        },
                        {
                            "code": 81533067,
                            "name": "慈云寺",

                        },
                        {
                            "code": 1024,
                            "name": "东坝",

                        },
                        {
                            "code": 561,
                            "name": "东大桥",

                        },
                        {
                            "code": 1383,
                            "name": "定福庄",

                        },
                        {
                            "code": 441,
                            "name": "豆各庄",

                        },
                        {
                            "code": 55460371,
                            "name": "大郊亭",

                        },
                        {
                            "code": 251,
                            "name": "大山子",

                        },
                        {
                            "code": 618,
                            "name": "大屯",

                        },
                        {
                            "code": 674,
                            "name": "对外经贸",

                        },
                        {
                            "code": 37,
                            "name": "大望路",

                        },
                        {
                            "code": 2220,
                            "name": "东小口",

                        },
                        {
                            "code": 2106,
                            "name": "东直门",

                        },
                        {
                            "code": 82149418,
                            "name": "二外",

                        },
                        {
                            "code": 1286,
                            "name": "垡头",

                        },
                        {
                            "code": 142,
                            "name": "高碑店",

                        },
                        {
                            "code": 34849164,
                            "name": "甘露园",

                        },
                        {
                            "code": 117,
                            "name": "国贸",

                        },
                        {
                            "code": 1789,
                            "name": "广渠门",

                        },
                        {
                            "code": 156,
                            "name": "工体",

                        },
                        {
                            "code": 122,
                            "name": "国展",

                        },
                        {
                            "code": 309,
                            "name": "管庄",

                        },
                        {
                            "code": 3398,
                            "name": "花家地",

                        },
                        {
                            "code": 270,
                            "name": "呼家楼",

                        },
                        {
                            "code": 34569910,
                            "name": "欢乐谷",

                        },
                        {
                            "code": 370,
                            "name": "红庙",

                        },
                        {
                            "code": 631,
                            "name": "和平街",

                        },
                        {
                            "code": 833,
                            "name": "和平里",

                        },
                        {
                            "code": 84209445,
                            "name": "华威桥",

                        },
                        {
                            "code": 81505508,
                            "name": "惠新",

                        },
                        {
                            "code": 55881198,
                            "name": "惠新西街",

                        },
                        {
                            "code": 35671669,
                            "name": "旧宫",

                        },
                        {
                            "code": 386,
                            "name": "建国门",

                        },
                        {
                            "code": 101657481,
                            "name": "建国门内",

                        },
                        {
                            "code": 27,
                            "name": "劲松",

                        },
                        {
                            "code": 81788447,
                            "name": "将台路",

                        },
                        {
                            "code": 34572324,
                            "name": "建外",

                        },
                        {
                            "code": 282,
                            "name": "酒仙桥",

                        },
                        {
                            "code": 34653386,
                            "name": "健翔桥",

                        },
                        {
                            "code": 81967415,
                            "name": "林萃",

                        },
                        {
                            "code": 1040,
                            "name": "柳芳",

                        },
                        {
                            "code": 439,
                            "name": "来广营",

                        },
                        {
                            "code": 540,
                            "name": "亮马桥",

                        },
                        {
                            "code": 82402391,
                            "name": "蓝色港湾",

                        },
                        {
                            "code": 3294,
                            "name": "立水桥",

                        },
                        {
                            "code": 300,
                            "name": "马甸",

                        },
                        {
                            "code": 7587,
                            "name": "牡丹园",

                        },
                        {
                            "code": 34580539,
                            "name": "马泉营",

                        },
                        {
                            "code": 68901170,
                            "name": "麦子店",

                        },
                        {
                            "code": 55741618,
                            "name": "鸟巢",

                        },
                        {
                            "code": 55817781,
                            "name": "南磨房",

                        },
                        {
                            "code": 97270483,
                            "name": "南苑",

                        },
                        {
                            "code": 50442026,
                            "name": "农业展览馆",

                        },
                        {
                            "code": 208,
                            "name": "潘家园",

                        },
                        {
                            "code": 64488270,
                            "name": "青年路",

                        },
                        {
                            "code": 89097706,
                            "name": "仁和",

                        },
                        {
                            "code": 740,
                            "name": "十八里店",

                        },
                        {
                            "code": 354,
                            "name": "首都机场",

                        },
                        {
                            "code": 1701,
                            "name": "石佛营",

                        },
                        {
                            "code": 250,
                            "name": "四惠",

                        },
                        {
                            "code": 34569003,
                            "name": "孙河",

                        },
                        {
                            "code": 50419966,
                            "name": "四惠东",

                        },
                        {
                            "code": 71,
                            "name": "双井",

                        },
                        {
                            "code": 81561909,
                            "name": "水立方",

                        },
                        {
                            "code": 433,
                            "name": "十里河",

                        },
                        {
                            "code": 221,
                            "name": "十里堡",

                        },
                        {
                            "code": 10,
                            "name": "三里屯",

                        },
                        {
                            "code": 81152724,
                            "name": "世贸天阶",

                        },
                        {
                            "code": 34571344,
                            "name": "双桥",

                        },
                        {
                            "code": 735,
                            "name": "芍药居",

                        },
                        {
                            "code": 31,
                            "name": "三元桥",

                        },
                        {
                            "code": 175,
                            "name": "团结湖",

                        },
                        {
                            "code": 533,
                            "name": "甜水园",

                        },
                        {
                            "code": 3,
                            "name": "太阳宫",

                        },
                        {
                            "code": 3797,
                            "name": "天竺",

                        },
                        {
                            "code": 16,
                            "name": "望京",

                        },
                        {
                            "code": 34687232,
                            "name": "王四营",

                        },
                        {
                            "code": 2,
                            "name": "西坝河",

                        },
                        {
                            "code": 573,
                            "name": "小关",

                        },
                        {
                            "code": 352,
                            "name": "小红门",

                        },
                        {
                            "code": 7529,
                            "name": "小营",

                        },
                        {
                            "code": 81059497,
                            "name": "霄云路",

                        },
                        {
                            "code": 34573035,
                            "name": "姚家园",

                        },
                        {
                            "code": 1880,
                            "name": "燕莎",

                        },
                        {
                            "code": 83852050,
                            "name": "永泰",

                        },
                        {
                            "code": 49,
                            "name": "亚运村",

                        },
                        {
                            "code": 81,
                            "name": "左家庄",

                        },
                        {
                            "code": 34579168,
                            "name": "中央别墅区",

                        }
                    ]
                },
                {
                    "code": 110107,
                    "name": "石景山区",
                    "subLevelModelList": [
                        {
                            "code": 2807,
                            "name": "八大处",

                        },
                        {
                            "code": 750,
                            "name": "八角",

                        },
                        {
                            "code": 743,
                            "name": "古城",

                        },
                        {
                            "code": 3749,
                            "name": "广宁",

                        },
                        {
                            "code": 1053,
                            "name": "金顶街",

                        },
                        {
                            "code": 461,
                            "name": "鲁谷",

                        },
                        {
                            "code": 3362,
                            "name": "龙泉",

                        },
                        {
                            "code": 1402,
                            "name": "老山",

                        },
                        {
                            "code": 2909,
                            "name": "模式口",

                        },
                        {
                            "code": 470,
                            "name": "苹果园",

                        },
                        {
                            "code": 2944,
                            "name": "田村",

                        },
                        {
                            "code": 2725,
                            "name": "西山",

                        },
                        {
                            "code": 81190097,
                            "name": "香山",

                        },
                        {
                            "code": 672,
                            "name": "衙门口",

                        },
                        {
                            "code": 50742347,
                            "name": "玉泉路",

                        },
                        {
                            "code": 1702,
                            "name": "杨庄",

                        }
                    ]
                },
                {
                    "code": 110106,
                    "name": "丰台区",
                    "subLevelModelList": [
                        {
                            "code": 220,
                            "name": "北大地",

                        },
                        {
                            "code": 34607390,
                            "name": "北京南站",

                        },
                        {
                            "code": 50447650,
                            "name": "北京西站",

                        },
                        {
                            "code": 51910762,
                            "name": "白纸坊",

                        },
                        {
                            "code": 389,
                            "name": "菜户营",

                        },
                        {
                            "code": 697,
                            "name": "草桥",

                        },
                        {
                            "code": 3364,
                            "name": "成寿寺",

                        },
                        {
                            "code": 919,
                            "name": "长辛店",

                        },
                        {
                            "code": 1752,
                            "name": "东高地",

                        },
                        {
                            "code": 143,
                            "name": "大红门",

                        },
                        {
                            "code": 68900169,
                            "name": "东铁匠营",

                        },
                        {
                            "code": 81988309,
                            "name": "丰管路",

                        },
                        {
                            "code": 155,
                            "name": "方庄",

                        },
                        {
                            "code": 50499494,
                            "name": "分钟寺",

                        },
                        {
                            "code": 1995,
                            "name": "广安门",

                        },
                        {
                            "code": 50431305,
                            "name": "公益西桥",

                        },
                        {
                            "code": 7757,
                            "name": "红莲",

                        },
                        {
                            "code": 105,
                            "name": "花乡",

                        },
                        {
                            "code": 50433126,
                            "name": "和义",

                        },
                        {
                            "code": 6914,
                            "name": "旧宫",

                        },
                        {
                            "code": 50433442,
                            "name": "纪家庙",

                        },
                        {
                            "code": 7580,
                            "name": "角门",

                        },
                        {
                            "code": 2739,
                            "name": "看丹桥",

                        },
                        {
                            "code": 436,
                            "name": "科技园区",

                        },
                        {
                            "code": 7466,
                            "name": "开阳里",

                        },
                        {
                            "code": 10043,
                            "name": "鲁谷",

                        },
                        {
                            "code": 1476,
                            "name": "卢沟桥",

                        },
                        {
                            "code": 50,
                            "name": "刘家窑",

                        },
                        {
                            "code": 238,
                            "name": "六里桥",

                        },
                        {
                            "code": 34572697,
                            "name": "丽泽",

                        },
                        {
                            "code": 503,
                            "name": "马家堡",

                        },
                        {
                            "code": 2670,
                            "name": "马连道",

                        },
                        {
                            "code": 559,
                            "name": "木樨园",

                        },
                        {
                            "code": 651,
                            "name": "南苑",

                        },
                        {
                            "code": 542,
                            "name": "蒲黄榆",

                        },
                        {
                            "code": 34583533,
                            "name": "青龙湖",

                        },
                        {
                            "code": 50428815,
                            "name": "七里庄",

                        },
                        {
                            "code": 1551,
                            "name": "青塔",

                        },
                        {
                            "code": 2632,
                            "name": "十八里店",

                        },
                        {
                            "code": 3448,
                            "name": "世界公园",

                        },
                        {
                            "code": 68,
                            "name": "宋家庄",

                        },
                        {
                            "code": 76464,
                            "name": "十里河",

                        },
                        {
                            "code": 64674572,
                            "name": "石榴庄",

                        },
                        {
                            "code": 48995350,
                            "name": "太平桥",

                        },
                        {
                            "code": 82516077,
                            "name": "万丰路",

                        },
                        {
                            "code": 1693,
                            "name": "五里店",

                        },
                        {
                            "code": 7699,
                            "name": "万寿路",

                        },
                        {
                            "code": 619,
                            "name": "新发地",

                        },
                        {
                            "code": 50429628,
                            "name": "新宫",

                        },
                        {
                            "code": 2809,
                            "name": "西红门",

                        },
                        {
                            "code": 50171191,
                            "name": "夏家胡同",

                        },
                        {
                            "code": 7610,
                            "name": "西客站",

                        },
                        {
                            "code": 2974,
                            "name": "西罗园",

                        },
                        {
                            "code": 95977654,
                            "name": "右安门",

                        },
                        {
                            "code": 81527890,
                            "name": "右安门外",

                        },
                        {
                            "code": 2640,
                            "name": "云岗",

                        },
                        {
                            "code": 7532,
                            "name": "岳各庄",

                        },
                        {
                            "code": 107682274,
                            "name": "郁花园",

                        },
                        {
                            "code": 788,
                            "name": "洋桥",

                        },
                        {
                            "code": 334,
                            "name": "玉泉营",

                        },
                        {
                            "code": 89868108,
                            "name": "左安门",

                        },
                        {
                            "code": 82272919,
                            "name": "总部基地",

                        },
                        {
                            "code": 2376,
                            "name": "赵公口",

                        }
                    ]
                },
                {
                    "code": 110109,
                    "name": "门头沟区",
                    "subLevelModelList": [
                        {
                            "code": 68507564,
                            "name": "滨河西区",

                        },
                        {
                            "code": 68908737,
                            "name": "城子",

                        },
                        {
                            "code": 5978,
                            "name": "东辛房",

                        },
                        {
                            "code": 1280,
                            "name": "大峪",

                        },
                        {
                            "code": 83255100,
                            "name": "冯村",

                        },
                        {
                            "code": 94730858,
                            "name": "古城",

                        },
                        {
                            "code": 106010120,
                            "name": "京西十八潭",

                        },
                        {
                            "code": 85558565,
                            "name": "军庄镇",

                        },
                        {
                            "code": 99492655,
                            "name": "龙凤山滑雪场",

                        },
                        {
                            "code": 1058,
                            "name": "龙泉",

                        },
                        {
                            "code": 64748072,
                            "name": "石门营",

                        },
                        {
                            "code": 36141065,
                            "name": "潭柘寺",

                        },
                        {
                            "code": 2444,
                            "name": "永定",

                        }
                    ]
                },
                {
                    "code": 110108,
                    "name": "海淀区",
                    "subLevelModelList": [
                        {
                            "code": 90226697,
                            "name": "309医院",

                        },
                        {
                            "code": 83196945,
                            "name": "安宁庄",

                        },
                        {
                            "code": 7160,
                            "name": "奥运村",

                        },
                        {
                            "code": 6949,
                            "name": "八大处",

                        },
                        {
                            "code": 3634,
                            "name": "八角",

                        },
                        {
                            "code": 3197,
                            "name": "北京大学",

                        },
                        {
                            "code": 50422156,
                            "name": "北京西站",

                        },
                        {
                            "code": 891,
                            "name": "白石桥",

                        },
                        {
                            "code": 1272,
                            "name": "北沙滩",

                        },
                        {
                            "code": 80,
                            "name": "北太平庄",

                        },
                        {
                            "code": 384,
                            "name": "北下关",

                        },
                        {
                            "code": 50423533,
                            "name": "车道沟",

                        },
                        {
                            "code": 364,
                            "name": "车公庄",

                        },
                        {
                            "code": 2488,
                            "name": "定慧寺",

                        },
                        {
                            "code": 2311,
                            "name": "德胜门",

                        },
                        {
                            "code": 1005,
                            "name": "动物园",

                        },
                        {
                            "code": 584,
                            "name": "东小口",

                        },
                        {
                            "code": 34587632,
                            "name": "大钟寺",

                        },
                        {
                            "code": 91139521,
                            "name": "二拨子村",

                        },
                        {
                            "code": 7666,
                            "name": "二里庄",

                        },
                        {
                            "code": 81094670,
                            "name": "广安门",

                        },
                        {
                            "code": 243,
                            "name": "甘家口",

                        },
                        {
                            "code": 749,
                            "name": "公主坟",

                        },
                        {
                            "code": 6745,
                            "name": "回龙观",

                        },
                        {
                            "code": 380,
                            "name": "航天桥",

                        },
                        {
                            "code": 10070,
                            "name": "霍营",

                        },
                        {
                            "code": 765,
                            "name": "花园桥",

                        },
                        {
                            "code": 34585589,
                            "name": "军博",

                        },
                        {
                            "code": 365,
                            "name": "蓟门桥",

                        },
                        {
                            "code": 50597368,
                            "name": "积水潭",

                        },
                        {
                            "code": 81193354,
                            "name": "交通大学",

                        },
                        {
                            "code": 81820101,
                            "name": "健翔桥",

                        },
                        {
                            "code": 98388611,
                            "name": "林萃",

                        },
                        {
                            "code": 83012240,
                            "name": "莲花池东路",

                        },
                        {
                            "code": 2137,
                            "name": "六里桥",

                        },
                        {
                            "code": 205,
                            "name": "马甸",

                        },
                        {
                            "code": 1002,
                            "name": "牡丹园",

                        },
                        {
                            "code": 252,
                            "name": "马连洼",

                        },
                        {
                            "code": 6535,
                            "name": "木樨地",

                        },
                        {
                            "code": 81058250,
                            "name": "农业大学西区",

                        },
                        {
                            "code": 169,
                            "name": "清河",

                        },
                        {
                            "code": 7034,
                            "name": "青塔",

                        },
                        {
                            "code": 172,
                            "name": "人民大学",

                        },
                        {
                            "code": 82432417,
                            "name": "双安",

                        },
                        {
                            "code": 90,
                            "name": "上地",

                        },
                        {
                            "code": 694,
                            "name": "世纪城",

                        },
                        {
                            "code": 78,
                            "name": "四季青",

                        },
                        {
                            "code": 1256,
                            "name": "三里河",

                        },
                        {
                            "code": 86,
                            "name": "双榆树",

                        },
                        {
                            "code": 383,
                            "name": "苏州街",

                        },
                        {
                            "code": 19,
                            "name": "苏州桥",

                        },
                        {
                            "code": 792,
                            "name": "田村",

                        },
                        {
                            "code": 3303,
                            "name": "五道口",

                        },
                        {
                            "code": 425,
                            "name": "魏公村",

                        },
                        {
                            "code": 263,
                            "name": "五棵松",

                        },
                        {
                            "code": 21,
                            "name": "万柳",

                        },
                        {
                            "code": 82155862,
                            "name": "五路居",

                        },
                        {
                            "code": 3632,
                            "name": "万泉河",

                        },
                        {
                            "code": 1405,
                            "name": "万寿路",

                        },
                        {
                            "code": 58848909,
                            "name": "万寿寺",

                        },
                        {
                            "code": 160,
                            "name": "西北旺",

                        },
                        {
                            "code": 193,
                            "name": "西二旗",

                        },
                        {
                            "code": 111,
                            "name": "新街口",

                        },
                        {
                            "code": 1059,
                            "name": "香山",

                        },
                        {
                            "code": 7537,
                            "name": "西山",

                        },
                        {
                            "code": 1044,
                            "name": "西三旗",

                        },
                        {
                            "code": 2593,
                            "name": "小西天",

                        },
                        {
                            "code": 7731,
                            "name": "西苑",

                        },
                        {
                            "code": 46,
                            "name": "学院路",

                        },
                        {
                            "code": 771,
                            "name": "西直门",

                        },
                        {
                            "code": 165,
                            "name": "远大路",

                        },
                        {
                            "code": 454,
                            "name": "颐和园",

                        },
                        {
                            "code": 1037,
                            "name": "圆明园",

                        },
                        {
                            "code": 50427876,
                            "name": "玉泉路",

                        },
                        {
                            "code": 81156367,
                            "name": "永泰",

                        },
                        {
                            "code": 102,
                            "name": "知春路",

                        },
                        {
                            "code": 100233472,
                            "name": "郑常庄村",

                        },
                        {
                            "code": 60,
                            "name": "中关村",

                        },
                        {
                            "code": 903,
                            "name": "皂君庙",

                        },
                        {
                            "code": 3434,
                            "name": "展览路",

                        },
                        {
                            "code": 209,
                            "name": "紫竹桥",

                        }
                    ]
                },
                {
                    "code": 110111,
                    "name": "房山区",
                    "subLevelModelList": [
                        {
                            "code": 34665555,
                            "name": "城关",

                        },
                        {
                            "code": 888,
                            "name": "长阳",

                        },
                        {
                            "code": 1313,
                            "name": "窦店",

                        },
                        {
                            "code": 91782729,
                            "name": "东湖港",

                        },
                        {
                            "code": 58433842,
                            "name": "河北镇",

                        },
                        {
                            "code": 5765,
                            "name": "韩村河",

                        },
                        {
                            "code": 91818252,
                            "name": "卢沟桥",

                        },
                        {
                            "code": 35037625,
                            "name": "琉璃河",

                        },
                        {
                            "code": 226,
                            "name": "良乡",

                        },
                        {
                            "code": 93764569,
                            "name": "仙栖洞",

                        },
                        {
                            "code": 863,
                            "name": "阎村",

                        },
                        {
                            "code": 34573336,
                            "name": "燕山",

                        }
                    ]
                },
                {
                    "code": 110113,
                    "name": "顺义区",
                    "subLevelModelList": [
                        {
                            "code": 893,
                            "name": "光明",

                        },
                        {
                            "code": 69,
                            "name": "后沙峪",

                        },
                        {
                            "code": 2093,
                            "name": "李桥",

                        },
                        {
                            "code": 1486,
                            "name": "马坡",

                        },
                        {
                            "code": 3312,
                            "name": "南彩",

                        },
                        {
                            "code": 64463696,
                            "name": "南法信",

                        },
                        {
                            "code": 93569164,
                            "name": "桥梓",

                        },
                        {
                            "code": 984,
                            "name": "仁和",

                        },
                        {
                            "code": 2522,
                            "name": "首都机场",

                        },
                        {
                            "code": 1887,
                            "name": "胜利",

                        },
                        {
                            "code": 783,
                            "name": "石园",

                        },
                        {
                            "code": 34568979,
                            "name": "顺义城",

                        },
                        {
                            "code": 54,
                            "name": "天竺",

                        },
                        {
                            "code": 84191209,
                            "name": "裕龙",

                        },
                        {
                            "code": 83420531,
                            "name": "央美博艺艺术馆",

                        },
                        {
                            "code": 38836351,
                            "name": "中央别墅区",

                        }
                    ]
                },
                {
                    "code": 110112,
                    "name": "通州区",
                    "subLevelModelList": [
                        {
                            "code": 2409,
                            "name": "北关",

                        },
                        {
                            "code": 596,
                            "name": "八里桥",

                        },
                        {
                            "code": 34576294,
                            "name": "次渠",

                        },
                        {
                            "code": 86641206,
                            "name": "常营",

                        },
                        {
                            "code": 82645828,
                            "name": "大学城",

                        },
                        {
                            "code": 52,
                            "name": "果园",

                        },
                        {
                            "code": 7063,
                            "name": "九棵树",

                        },
                        {
                            "code": 68902424,
                            "name": "开发区",

                        },
                        {
                            "code": 2457,
                            "name": "潞城",

                        },
                        {
                            "code": 48702364,
                            "name": "临河里",

                        },
                        {
                            "code": 6793,
                            "name": "李桥",

                        },
                        {
                            "code": 356,
                            "name": "梨园",

                        },
                        {
                            "code": 34642366,
                            "name": "潞苑",

                        },
                        {
                            "code": 385,
                            "name": "马驹桥",

                        },
                        {
                            "code": 1234,
                            "name": "乔庄",

                        },
                        {
                            "code": 35212965,
                            "name": "双桥",

                        },
                        {
                            "code": 34579912,
                            "name": "宋庄",

                        },
                        {
                            "code": 591,
                            "name": "土桥",

                        },
                        {
                            "code": 1772,
                            "name": "通州西门",

                        },
                        {
                            "code": 1695,
                            "name": "武夷花园",

                        },
                        {
                            "code": 81027064,
                            "name": "物资学院",

                        },
                        {
                            "code": 321,
                            "name": "新华大街",

                        },
                        {
                            "code": 6922,
                            "name": "新华联",

                        },
                        {
                            "code": 35234082,
                            "name": "西集",

                        },
                        {
                            "code": 101,
                            "name": "玉桥",

                        },
                        {
                            "code": 405,
                            "name": "永顺",

                        },
                        {
                            "code": 1204,
                            "name": "中仓",

                        },
                        {
                            "code": 1597,
                            "name": "张家湾",

                        },
                        {
                            "code": 89370228,
                            "name": "中央别墅区",

                        }
                    ]
                },
                {
                    "code": 110115,
                    "name": "大兴区",
                    "subLevelModelList": [
                        {
                            "code": 222884548,
                            "name": "城乡科技园区",

                        },
                        {
                            "code": 222884549,
                            "name": "采育开发区",

                        },
                        {
                            "code": 2840,
                            "name": "东高地",

                        },
                        {
                            "code": 82920642,
                            "name": "德茂桥",

                        },
                        {
                            "code": 222885212,
                            "name": "大兴经济开发区",

                        },
                        {
                            "code": 48899667,
                            "name": "高米店南",

                        },
                        {
                            "code": 59,
                            "name": "黄村",

                        },
                        {
                            "code": 48870140,
                            "name": "和义",

                        },
                        {
                            "code": 7915,
                            "name": "海子角",

                        },
                        {
                            "code": 327,
                            "name": "旧宫",

                        },
                        {
                            "code": 2132,
                            "name": "林校路",

                        },
                        {
                            "code": 1522,
                            "name": "马驹桥",

                        },
                        {
                            "code": 1307,
                            "name": "庞各庄",

                        },
                        {
                            "code": 419,
                            "name": "清源",

                        },
                        {
                            "code": 3762,
                            "name": "十八里店",

                        },
                        {
                            "code": 48931291,
                            "name": "天宫院",

                        },
                        {
                            "code": 55569917,
                            "name": "兴丰",

                        },
                        {
                            "code": 10114,
                            "name": "新发地",

                        },
                        {
                            "code": 600,
                            "name": "西红门",

                        },
                        {
                            "code": 6985,
                            "name": "小红门",

                        },
                        {
                            "code": 3248,
                            "name": "兴业大街",

                        },
                        {
                            "code": 34630167,
                            "name": "瀛海",

                        },
                        {
                            "code": 121,
                            "name": "亦庄",

                        },
                        {
                            "code": 50432589,
                            "name": "枣园",

                        }
                    ]
                },
                {
                    "code": 110114,
                    "name": "昌平区",
                    "subLevelModelList": [
                        {
                            "code": 112213041,
                            "name": "八达岭",

                        },
                        {
                            "code": 509,
                            "name": "北七家",

                        },
                        {
                            "code": 1089,
                            "name": "百善",

                        },
                        {
                            "code": 56709431,
                            "name": "城北",

                        },
                        {
                            "code": 1730,
                            "name": "城南",

                        },
                        {
                            "code": 80966427,
                            "name": "昌平镇",

                        },
                        {
                            "code": 62804670,
                            "name": "东关",

                        },
                        {
                            "code": 478,
                            "name": "东小口",

                        },
                        {
                            "code": 83148298,
                            "name": "二拨子村",

                        },
                        {
                            "code": 82539586,
                            "name": "鼓楼大街",

                        },
                        {
                            "code": 199,
                            "name": "回龙观",

                        },
                        {
                            "code": 7525,
                            "name": "霍营",

                        },
                        {
                            "code": 84113677,
                            "name": "居庸关长城",

                        },
                        {
                            "code": 7520,
                            "name": "立水桥",

                        },
                        {
                            "code": 50426147,
                            "name": "龙泽",

                        },
                        {
                            "code": 260,
                            "name": "马池口",

                        },
                        {
                            "code": 515,
                            "name": "南口",

                        },
                        {
                            "code": 1304,
                            "name": "南邵",

                        },
                        {
                            "code": 246,
                            "name": "沙河",

                        },
                        {
                            "code": 81983583,
                            "name": "十三陵水库",

                        },
                        {
                            "code": 168,
                            "name": "天通苑",

                        },
                        {
                            "code": 3113,
                            "name": "西二旗",

                        },
                        {
                            "code": 58841144,
                            "name": "西关环岛",

                        },
                        {
                            "code": 93177953,
                            "name": "兴寿",

                        },
                        {
                            "code": 368,
                            "name": "西三旗",

                        },
                        {
                            "code": 581,
                            "name": "小汤山",

                        },
                        {
                            "code": 2648,
                            "name": "阳坊",

                        }
                    ]
                },
                {
                    "code": 110117,
                    "name": "平谷区",
                    "subLevelModelList": [
                        {
                            "code": 72038736,
                            "name": "玻璃台",

                        },
                        {
                            "code": 2351,
                            "name": "金海湖",

                        },
                        {
                            "code": 9701,
                            "name": "刘家店",

                        },
                        {
                            "code": 6994,
                            "name": "马昌营",

                        },
                        {
                            "code": 34675364,
                            "name": "平谷城区",

                        },
                        {
                            "code": 34995279,
                            "name": "石林峡",

                        },
                        {
                            "code": 89792787,
                            "name": "王辛庄村",

                        },
                        {
                            "code": 67297264,
                            "name": "熊儿寨",

                        },
                        {
                            "code": 1834,
                            "name": "兴谷",

                        }
                    ]
                },
                {
                    "code": 110116,
                    "name": "怀柔区",
                    "subLevelModelList": [
                        {
                            "code": 828,
                            "name": "北房",

                        },
                        {
                            "code": 69296320,
                            "name": "白河湾",

                        },
                        {
                            "code": 112018113,
                            "name": "百里画廊",

                        },
                        {
                            "code": 35310111,
                            "name": "红螺寺",

                        },
                        {
                            "code": 72213225,
                            "name": "莲花池",

                        },
                        {
                            "code": 112,
                            "name": "庙城",

                        },
                        {
                            "code": 35679080,
                            "name": "慕田峪长城",

                        },
                        {
                            "code": 1354,
                            "name": "泉河",

                        },
                        {
                            "code": 1579,
                            "name": "桥梓",

                        },
                        {
                            "code": 9695,
                            "name": "汤河口",

                        },
                        {
                            "code": 88152297,
                            "name": "云蒙山",

                        },
                        {
                            "code": 3082,
                            "name": "雁栖",

                        },
                        {
                            "code": 475,
                            "name": "杨宋",

                        }
                    ]
                },
                {
                    "code": 110119,
                    "name": "延庆区",
                    "subLevelModelList": [
                        {
                            "code": 3805,
                            "name": "八达岭",

                        },
                        {
                            "code": 3433,
                            "name": "康庄",

                        },
                        {
                            "code": 3669,
                            "name": "永宁",

                        },
                        {
                            "code": 34569263,
                            "name": "延庆城区",

                        }
                    ]
                },
                {
                    "code": 110118,
                    "name": "密云区",
                    "subLevelModelList": [
                        {
                            "code": 100784192,
                            "name": "古北口",

                        },
                        {
                            "code": 112124226,
                            "name": "古北水镇",

                        },
                        {
                            "code": 35533545,
                            "name": "密云水库",

                        },
                        {
                            "code": 34570520,
                            "name": "密云县县城",

                        },
                        {
                            "code": 34856090,
                            "name": "司马台长城",

                        },
                        {
                            "code": 50829289,
                            "name": "桃源仙谷",

                        }
                    ]
                }
            ],
        "chongqing":[
                {
                    "code": 500103,
                    "name": "渝中区",
                    "subLevelModelList": [
                        {
                            "code": 82034012,
                            "name": "重庆天地",

                        },
                        {
                            "code": 1622,
                            "name": "朝天门",

                        },
                        {
                            "code": 1321,
                            "name": "菜园坝",

                        },
                        {
                            "code": 82867571,
                            "name": "大礼堂",

                        },
                        {
                            "code": 964,
                            "name": "大坪",

                        },
                        {
                            "code": 2423,
                            "name": "大溪沟",

                        },
                        {
                            "code": 2597,
                            "name": "鹅岭",

                        },
                        {
                            "code": 86612536,
                            "name": "高新区",

                        },
                        {
                            "code": 2736,
                            "name": "化龙桥",

                        },
                        {
                            "code": 66185340,
                            "name": "洪崖洞",

                        },
                        {
                            "code": 3533,
                            "name": "较场口",

                        },
                        {
                            "code": 79,
                            "name": "解放碑",

                        },
                        {
                            "code": 81106521,
                            "name": "龙湖时代天街",

                        },
                        {
                            "code": 82202611,
                            "name": "临江门",

                        },
                        {
                            "code": 756,
                            "name": "两路口",

                        },
                        {
                            "code": 2102,
                            "name": "七星岗",

                        },
                        {
                            "code": 1430,
                            "name": "上清寺",

                        },
                        {
                            "code": 34743272,
                            "name": "袁家岗",

                        },
                        {
                            "code": 51,
                            "name": "渝州路",

                        },
                        {
                            "code": 76525874,
                            "name": "总部城",

                        }
                    ]
                },
                {
                    "code": 500231,
                    "name": "垫江县",
                    "subLevelModelList": [
                        {
                            "code": 34624901,
                            "name": "垫江",

                        }
                    ]
                },
                {
                    "code": 500102,
                    "name": "涪陵区",
                    "subLevelModelList": [
                        {
                            "code": 34843708,
                            "name": "滨江路",

                        },
                        {
                            "code": 34964452,
                            "name": "宝龙广场",

                        },
                        {
                            "code": 13452620,
                            "name": "白涛",

                        },
                        {
                            "code": 48774636,
                            "name": "敦仁",

                        },
                        {
                            "code": 38245808,
                            "name": "宏声大道",

                        },
                        {
                            "code": 34828301,
                            "name": "海怡天",

                        },
                        {
                            "code": 6553,
                            "name": "江东",

                        },
                        {
                            "code": 7823,
                            "name": "李渡",

                        },
                        {
                            "code": 68778110,
                            "name": "龙潭镇",

                        },
                        {
                            "code": 90998701,
                            "name": "龙湾",

                        },
                        {
                            "code": 36199985,
                            "name": "荔枝",

                        },
                        {
                            "code": 37920865,
                            "name": "马鞍",

                        },
                        {
                            "code": 35525123,
                            "name": "南门山",

                        },
                        {
                            "code": 37316585,
                            "name": "清溪",

                        },
                        {
                            "code": 34575433,
                            "name": "顺江好吃街",

                        },
                        {
                            "code": 55892405,
                            "name": "太极",

                        },
                        {
                            "code": 68627029,
                            "name": "义和",

                        },
                        {
                            "code": 34618584,
                            "name": "易家坝",

                        }
                    ]
                },
                {
                    "code": 500230,
                    "name": "丰都县",
                    "subLevelModelList": [
                        {
                            "code": 68454815,
                            "name": "名山",

                        },
                        {
                            "code": 64461046,
                            "name": "三合",

                        }
                    ]
                },
                {
                    "code": 500101,
                    "name": "万州区",
                    "subLevelModelList": [
                        {
                            "code": 34636834,
                            "name": "北山",

                        },
                        {
                            "code": 55483122,
                            "name": "白羊村",

                        },
                        {
                            "code": 83525723,
                            "name": "白岩路",

                        },
                        {
                            "code": 34572446,
                            "name": "陈家坝",

                        },
                        {
                            "code": 3293,
                            "name": "高笋塘",

                        },
                        {
                            "code": 35121325,
                            "name": "观音岩",

                        },
                        {
                            "code": 7919,
                            "name": "龙都",

                        },
                        {
                            "code": 75948948,
                            "name": "龙驹",

                        },
                        {
                            "code": 51871769,
                            "name": "牌楼",

                        },
                        {
                            "code": 34948834,
                            "name": "双河口",

                        },
                        {
                            "code": 6641,
                            "name": "孙家",

                        },
                        {
                            "code": 36823955,
                            "name": "沙龙路",

                        },
                        {
                            "code": 2397,
                            "name": "太白",

                        },
                        {
                            "code": 5847,
                            "name": "天城",

                        },
                        {
                            "code": 81230096,
                            "name": "万达广场",

                        },
                        {
                            "code": 35220051,
                            "name": "王牌路",

                        },
                        {
                            "code": 2121,
                            "name": "五桥",

                        },
                        {
                            "code": 95043267,
                            "name": "兴茂",

                        },
                        {
                            "code": 83536057,
                            "name": "移民广场",

                        },
                        {
                            "code": 7832,
                            "name": "周家坝",

                        }
                    ]
                },
                {
                    "code": 500229,
                    "name": "城口县",
                    "subLevelModelList": [
                        {
                            "code": 38107561,
                            "name": "城口商贸中心",

                        },
                        {
                            "code": 69084883,
                            "name": "复兴",

                        },
                        {
                            "code": 64807534,
                            "name": "葛城",

                        }
                    ]
                },
                {
                    "code": 500111,
                    "name": "大足区",
                    "subLevelModelList": [
                        {
                            "code": 36964492,
                            "name": "龙滩子",

                        },
                        {
                            "code": 3217,
                            "name": "双路",

                        }
                    ]
                },
                {
                    "code": 500110,
                    "name": "綦江区",
                    "subLevelModelList": [
                        {
                            "code": 35646918,
                            "name": "关坝",

                        },
                        {
                            "code": 64193383,
                            "name": "黑山谷景区",

                        },
                        {
                            "code": 36059078,
                            "name": "綦江区政府",

                        },
                        {
                            "code": 6326,
                            "name": "万东",

                        }
                    ]
                },
                {
                    "code": 500238,
                    "name": "巫溪县",
                    "subLevelModelList": [
                        {
                            "code": 64545516,
                            "name": "柏杨",

                        },
                        {
                            "code": 64638274,
                            "name": "宁河",

                        }
                    ]
                },
                {
                    "code": 500109,
                    "name": "北碚区",
                    "subLevelModelList": [
                        {
                            "code": 34625792,
                            "name": "北碚城南",

                        },
                        {
                            "code": 6675,
                            "name": "北温泉",

                        },
                        {
                            "code": 82588041,
                            "name": "蔡家岗",

                        },
                        {
                            "code": 1640,
                            "name": "朝阳",

                        },
                        {
                            "code": 56741112,
                            "name": "复兴街道",

                        },
                        {
                            "code": 64122111,
                            "name": "静观",

                        },
                        {
                            "code": 37067508,
                            "name": "九号好吃街",

                        },
                        {
                            "code": 83668917,
                            "name": "老城区",

                        },
                        {
                            "code": 3618,
                            "name": "龙凤桥",

                        },
                        {
                            "code": 35157433,
                            "name": "双柏树高速路口",

                        },
                        {
                            "code": 7288,
                            "name": "施家梁",

                        },
                        {
                            "code": 35431075,
                            "name": "三圣",

                        },
                        {
                            "code": 38653864,
                            "name": "水土",

                        },
                        {
                            "code": 86436991,
                            "name": "三溪口",

                        },
                        {
                            "code": 36827558,
                            "name": "童家溪",

                        },
                        {
                            "code": 83135963,
                            "name": "天奇广场",

                        },
                        {
                            "code": 82348576,
                            "name": "团山堡",

                        },
                        {
                            "code": 35254686,
                            "name": "天生丽街",

                        },
                        {
                            "code": 34696643,
                            "name": "万达广场",

                        },
                        {
                            "code": 73466712,
                            "name": "文星湾",

                        },
                        {
                            "code": 2284,
                            "name": "歇马",

                        }
                    ]
                },
                {
                    "code": 500237,
                    "name": "巫山县",

                },
                {
                    "code": 500108,
                    "name": "南岸区",
                    "subLevelModelList": [
                        {
                            "code": 3682,
                            "name": "长生桥",

                        },
                        {
                            "code": 34571523,
                            "name": "茶园新区",

                        },
                        {
                            "code": 82750451,
                            "name": "大佛段",

                        },
                        {
                            "code": 35905904,
                            "name": "丹龙路",

                        },
                        {
                            "code": 81286109,
                            "name": "工贸",

                        },
                        {
                            "code": 38503599,
                            "name": "黄桷垭",

                        },
                        {
                            "code": 6435,
                            "name": "回龙湾",

                        },
                        {
                            "code": 3187,
                            "name": "海棠溪",

                        },
                        {
                            "code": 1057,
                            "name": "花园路",

                        },
                        {
                            "code": 6499,
                            "name": "鸡冠石",

                        },
                        {
                            "code": 35462532,
                            "name": "六公里",

                        },
                        {
                            "code": 80999335,
                            "name": "南岸区南坪(商圈)",

                        },
                        {
                            "code": 696,
                            "name": "南滨路",

                        },
                        {
                            "code": 361,
                            "name": "南坪",

                        },
                        {
                            "code": 34872667,
                            "name": "南山",

                        },
                        {
                            "code": 34566662,
                            "name": "七公里",

                        },
                        {
                            "code": 51171002,
                            "name": "融侨半岛",

                        },
                        {
                            "code": 1079,
                            "name": "四公里",

                        },
                        {
                            "code": 82172548,
                            "name": "盛汇广场",

                        },
                        {
                            "code": 83305973,
                            "name": "上新街",

                        },
                        {
                            "code": 55795274,
                            "name": "涂山",

                        },
                        {
                            "code": 7617,
                            "name": "铜元局",

                        },
                        {
                            "code": 1553,
                            "name": "弹子石",

                        },
                        {
                            "code": 81786220,
                            "name": "万达",

                        },
                        {
                            "code": 34598490,
                            "name": "五公里",

                        },
                        {
                            "code": 64379798,
                            "name": "迎龙",

                        }
                    ]
                },
                {
                    "code": 500236,
                    "name": "奉节县",

                },
                {
                    "code": 500107,
                    "name": "九龙坡区",
                    "subLevelModelList": [
                        {
                            "code": 3672,
                            "name": "巴福",

                        },
                        {
                            "code": 34587167,
                            "name": "巴国城",

                        },
                        {
                            "code": 1712,
                            "name": "白市驿",

                        },
                        {
                            "code": 34574294,
                            "name": "陈家坪",

                        },
                        {
                            "code": 82258864,
                            "name": "彩云湖",

                        },
                        {
                            "code": 35003441,
                            "name": "动物园",

                        },
                        {
                            "code": 48808694,
                            "name": "二郎",

                        },
                        {
                            "code": 55910845,
                            "name": "高新区",

                        },
                        {
                            "code": 6578,
                            "name": "含谷",

                        },
                        {
                            "code": 6380,
                            "name": "黄桷坪",

                        },
                        {
                            "code": 1919,
                            "name": "华岩",

                        },
                        {
                            "code": 87201683,
                            "name": "九滨路",

                        },
                        {
                            "code": 2781,
                            "name": "金凤",

                        },
                        {
                            "code": 82011130,
                            "name": "九龙坡(商圈)",

                        },
                        {
                            "code": 81138298,
                            "name": "九龙镇",

                        },
                        {
                            "code": 7582,
                            "name": "马王乡",

                        },
                        {
                            "code": 83784174,
                            "name": "毛线沟",

                        },
                        {
                            "code": 81997270,
                            "name": "蟠龙",

                        },
                        {
                            "code": 83031220,
                            "name": "盘龙",

                        },
                        {
                            "code": 63796412,
                            "name": "石板",

                        },
                        {
                            "code": 218475115,
                            "name": "石坪桥",

                        },
                        {
                            "code": 2316,
                            "name": "石桥铺",

                        },
                        {
                            "code": 10003,
                            "name": "陶家",

                        },
                        {
                            "code": 1076,
                            "name": "谢家湾",

                        },
                        {
                            "code": 3732,
                            "name": "西彭",

                        },
                        {
                            "code": 82671640,
                            "name": "歇台子",

                        },
                        {
                            "code": 34578256,
                            "name": "袁家岗",

                        },
                        {
                            "code": 605,
                            "name": "杨家坪",

                        },
                        {
                            "code": 1632,
                            "name": "渝州路",

                        },
                        {
                            "code": 82611896,
                            "name": "直港大道",

                        },
                        {
                            "code": 7550,
                            "name": "中梁山",

                        }
                    ]
                },
                {
                    "code": 500235,
                    "name": "云阳县",
                    "subLevelModelList": [
                        {
                            "code": 83914148,
                            "name": "盘龙",

                        },
                        {
                            "code": 64493339,
                            "name": "青龙",

                        },
                        {
                            "code": 87709426,
                            "name": "人和",

                        },
                        {
                            "code": 64562831,
                            "name": "双江",

                        },
                        {
                            "code": 72347319,
                            "name": "亿联商贸城",

                        }
                    ]
                },
                {
                    "code": 500106,
                    "name": "沙坪坝区",
                    "subLevelModelList": [
                        {
                            "code": 5958,
                            "name": "曾家",

                        },
                        {
                            "code": 2244,
                            "name": "陈家桥",

                        },
                        {
                            "code": 1628,
                            "name": "重庆大学",

                        },
                        {
                            "code": 3096,
                            "name": "磁器口",

                        },
                        {
                            "code": 36991488,
                            "name": "大石坝",

                        },
                        {
                            "code": 1056,
                            "name": "大学城",

                        },
                        {
                            "code": 10323,
                            "name": "凤凰",

                        },
                        {
                            "code": 36633386,
                            "name": "凤天路",

                        },
                        {
                            "code": 3636,
                            "name": "歌乐山",

                        },
                        {
                            "code": 57039778,
                            "name": "高新区",

                        },
                        {
                            "code": 6405,
                            "name": "回龙坝",

                        },
                        {
                            "code": 1192,
                            "name": "虎溪",

                        },
                        {
                            "code": 85088907,
                            "name": "华宇金沙港湾",

                        },
                        {
                            "code": 2041,
                            "name": "汉渝路",

                        },
                        {
                            "code": 56309154,
                            "name": "井口",

                        },
                        {
                            "code": 94850133,
                            "name": "劳动路",

                        },
                        {
                            "code": 35060100,
                            "name": "烈士墓",

                        },
                        {
                            "code": 52153827,
                            "name": "梨树湾",

                        },
                        {
                            "code": 82939060,
                            "name": "美丽熙街",

                        },
                        {
                            "code": 10062,
                            "name": "青木关",

                        },
                        {
                            "code": 34663233,
                            "name": "双碑",

                        },
                        {
                            "code": 57728839,
                            "name": "沙滨路",

                        },
                        {
                            "code": 3485,
                            "name": "山洞",

                        },
                        {
                            "code": 61393396,
                            "name": "沙坪坝",

                        },
                        {
                            "code": 34572493,
                            "name": "三峡广场",

                        },
                        {
                            "code": 68095545,
                            "name": "沙正街",

                        },
                        {
                            "code": 2452,
                            "name": "覃家岗",

                        },
                        {
                            "code": 62905007,
                            "name": "土湾",

                        },
                        {
                            "code": 409,
                            "name": "天星桥",

                        },
                        {
                            "code": 6045,
                            "name": "土主",

                        },
                        {
                            "code": 164,
                            "name": "小龙坎",

                        },
                        {
                            "code": 3445,
                            "name": "新桥",

                        },
                        {
                            "code": 1314,
                            "name": "西永",

                        },
                        {
                            "code": 721,
                            "name": "渝碚路",

                        },
                        {
                            "code": 49790900,
                            "name": "杨公桥",

                        },
                        {
                            "code": 139548876,
                            "name": "詹家溪",

                        },
                        {
                            "code": 2946,
                            "name": "中梁",

                        },
                        {
                            "code": 87005424,
                            "name": "中梁山",

                        }
                    ]
                },
                {
                    "code": 500105,
                    "name": "江北区",
                    "subLevelModelList": [
                        {
                            "code": 34571713,
                            "name": "北滨路",

                        },
                        {
                            "code": 82060659,
                            "name": "北城天街",

                        },
                        {
                            "code": 2988,
                            "name": "寸滩",

                        },
                        {
                            "code": 82669071,
                            "name": "大融城",

                        },
                        {
                            "code": 2368,
                            "name": "大石坝",

                        },
                        {
                            "code": 83136468,
                            "name": "大兴村",

                        },
                        {
                            "code": 81556551,
                            "name": "东原新新PARK购物中心",

                        },
                        {
                            "code": 55618738,
                            "name": "复盛",

                        },
                        {
                            "code": 67688819,
                            "name": "郭家沱",

                        },
                        {
                            "code": 95878348,
                            "name": "高新区",

                        },
                        {
                            "code": 363,
                            "name": "观音桥",

                        },
                        {
                            "code": 34608746,
                            "name": "海尔路",

                        },
                        {
                            "code": 34621216,
                            "name": "鸿恩寺",

                        },
                        {
                            "code": 583,
                            "name": "黄泥塝",

                        },
                        {
                            "code": 57237451,
                            "name": "红旗河沟",

                        },
                        {
                            "code": 1366,
                            "name": "华新街",

                        },
                        {
                            "code": 81454493,
                            "name": "江北(商圈)",

                        },
                        {
                            "code": 35021521,
                            "name": "江北嘴",

                        },
                        {
                            "code": 82287077,
                            "name": "九街",

                        },
                        {
                            "code": 82770284,
                            "name": "金科十年城",

                        },
                        {
                            "code": 82695884,
                            "name": "建新东路",

                        },
                        {
                            "code": 82295077,
                            "name": "金源",

                        },
                        {
                            "code": 82444729,
                            "name": "龙湖源著",

                        },
                        {
                            "code": 34608753,
                            "name": "南桥寺",

                        },
                        {
                            "code": 81380425,
                            "name": "普泰广场",

                        },
                        {
                            "code": 83793466,
                            "name": "盘溪",

                        },
                        {
                            "code": 7021,
                            "name": "冉家坝",

                        },
                        {
                            "code": 86339227,
                            "name": "石门",

                        },
                        {
                            "code": 5822,
                            "name": "石马河",

                        },
                        {
                            "code": 82902383,
                            "name": "石子山体育公园",

                        },
                        {
                            "code": 822,
                            "name": "五里店",

                        },
                        {
                            "code": 82962026,
                            "name": "星悦荟",

                        },
                        {
                            "code": 34735505,
                            "name": "洋河花园",

                        },
                        {
                            "code": 6315,
                            "name": "鱼嘴",

                        }
                    ]
                },
                {
                    "code": 500233,
                    "name": "忠县",

                },
                {
                    "code": 500104,
                    "name": "大渡口区",
                    "subLevelModelList": [
                        {
                            "code": 38914477,
                            "name": "半岛逸景",

                        },
                        {
                            "code": 34698039,
                            "name": "巴国城",

                        },
                        {
                            "code": 88592037,
                            "name": "滨江路",

                        },
                        {
                            "code": 2371,
                            "name": "八桥",

                        },
                        {
                            "code": 82439426,
                            "name": "八桥镇",

                        },
                        {
                            "code": 57165983,
                            "name": "步行街",

                        },
                        {
                            "code": 35225729,
                            "name": "大渡口公园",

                        },
                        {
                            "code": 34620449,
                            "name": "大渡口区府",

                        },
                        {
                            "code": 82646366,
                            "name": "大堰",

                        },
                        {
                            "code": 7926,
                            "name": "九宫庙",

                        },
                        {
                            "code": 7031,
                            "name": "建胜",

                        },
                        {
                            "code": 7061,
                            "name": "马王乡",

                        },
                        {
                            "code": 6451,
                            "name": "茄子溪",

                        },
                        {
                            "code": 35651509,
                            "name": "双山",

                        },
                        {
                            "code": 3730,
                            "name": "新山村",

                        },
                        {
                            "code": 34648394,
                            "name": "新天泽国际广场",

                        }
                    ]
                },
                {
                    "code": 500119,
                    "name": "南川区",
                    "subLevelModelList": [
                        {
                            "code": 79808727,
                            "name": "金佛山",

                        },
                        {
                            "code": 37502454,
                            "name": "金佛山景区",

                        },
                        {
                            "code": 65757016,
                            "name": "南城",

                        },
                        {
                            "code": 55381845,
                            "name": "南川区中心城区",

                        },
                        {
                            "code": 65397590,
                            "name": "西城",

                        }
                    ]
                },
                {
                    "code": 500118,
                    "name": "永川区",
                    "subLevelModelList": [
                        {
                            "code": 99358960,
                            "name": "陈食",

                        },
                        {
                            "code": 34747896,
                            "name": "巨宇江南",

                        },
                        {
                            "code": 35585866,
                            "name": "老城区",

                        },
                        {
                            "code": 65680928,
                            "name": "南大街",

                        },
                        {
                            "code": 34572438,
                            "name": "人民广场",

                        },
                        {
                            "code": 64660985,
                            "name": "胜利路",

                        },
                        {
                            "code": 34985514,
                            "name": "商贸城",

                        },
                        {
                            "code": 34638060,
                            "name": "万达广场",

                        },
                        {
                            "code": 34582557,
                            "name": "兴龙湖",

                        },
                        {
                            "code": 64516606,
                            "name": "中山路",

                        }
                    ]
                },
                {
                    "code": 500117,
                    "name": "合川区",
                    "subLevelModelList": [
                        {
                            "code": 35766267,
                            "name": "滨江路",

                        },
                        {
                            "code": 35733491,
                            "name": "大学城",

                        },
                        {
                            "code": 64562938,
                            "name": "钓鱼城",

                        },
                        {
                            "code": 64512916,
                            "name": "合阳城",

                        },
                        {
                            "code": 35639531,
                            "name": "久长步行街",

                        },
                        {
                            "code": 35236064,
                            "name": "交通街",

                        },
                        {
                            "code": 35311901,
                            "name": "客运中心",

                        },
                        {
                            "code": 35135330,
                            "name": "南津街",

                        },
                        {
                            "code": 35144521,
                            "name": "区府",

                        },
                        {
                            "code": 47610916,
                            "name": "人文科技学院",

                        },
                        {
                            "code": 35418385,
                            "name": "上什字",

                        },
                        {
                            "code": 37422973,
                            "name": "文峰古街",

                        }
                    ]
                },
                {
                    "code": 500116,
                    "name": "江津区",
                    "subLevelModelList": [
                        {
                            "code": 7121,
                            "name": "巴福",

                        },
                        {
                            "code": 82554868,
                            "name": "滨江大道",

                        },
                        {
                            "code": 36708600,
                            "name": "滨江新城",

                        },
                        {
                            "code": 34982234,
                            "name": "德感",

                        },
                        {
                            "code": 34718665,
                            "name": "鼎山",

                        },
                        {
                            "code": 81517124,
                            "name": "大同路步行街",

                        },
                        {
                            "code": 34572280,
                            "name": "江津",

                        },
                        {
                            "code": 62916806,
                            "name": "双福",

                        },
                        {
                            "code": 83615834,
                            "name": "重百",

                        }
                    ]
                },
                {
                    "code": 500243,
                    "name": "彭水苗族土家族自治县",
                    "subLevelModelList": [
                        {
                            "code": 65696382,
                            "name": "汉葭",

                        }
                    ]
                },
                {
                    "code": 500115,
                    "name": "长寿区",
                    "subLevelModelList": [
                        {
                            "code": 34573825,
                            "name": "重庆化工职业学院",

                        },
                        {
                            "code": 34749802,
                            "name": "长寿北站",

                        },
                        {
                            "code": 36868315,
                            "name": "长寿古镇",

                        },
                        {
                            "code": 83593512,
                            "name": "长寿湖风景区",

                        },
                        {
                            "code": 87318047,
                            "name": "长寿汽车客运总站",

                        },
                        {
                            "code": 93469960,
                            "name": "长寿区人民医院",

                        },
                        {
                            "code": 87125623,
                            "name": "大洪河水库",

                        },
                        {
                            "code": 34960641,
                            "name": "第三人民医院",

                        },
                        {
                            "code": 339500,
                            "name": "渡舟",

                        },
                        {
                            "code": 3237,
                            "name": "凤城",

                        },
                        {
                            "code": 82324296,
                            "name": "葛兰镇",

                        },
                        {
                            "code": 94278666,
                            "name": "洪湖镇",

                        },
                        {
                            "code": 58897083,
                            "name": "邻封",

                        },
                        {
                            "code": 91576053,
                            "name": "双龙村",

                        },
                        {
                            "code": 34600712,
                            "name": "桃花新城",

                        },
                        {
                            "code": 59103429,
                            "name": "晏家",

                        }
                    ]
                },
                {
                    "code": 500114,
                    "name": "黔江区",
                    "subLevelModelList": [
                        {
                            "code": 106004708,
                            "name": "南海",

                        },
                        {
                            "code": 56098996,
                            "name": "黔江区中心城区",

                        }
                    ]
                },
                {
                    "code": 500242,
                    "name": "酉阳土家族苗族自治县",

                },
                {
                    "code": 500241,
                    "name": "秀山土家族苗族自治县",
                    "subLevelModelList": [
                        {
                            "code": 64518160,
                            "name": "中和",

                        }
                    ]
                },
                {
                    "code": 500113,
                    "name": "巴南区",
                    "subLevelModelList": [
                        {
                            "code": 38418347,
                            "name": "巴滨路",

                        },
                        {
                            "code": 48823897,
                            "name": "八公里",

                        },
                        {
                            "code": 10481,
                            "name": "东泉",

                        },
                        {
                            "code": 89751705,
                            "name": "二圣",

                        },
                        {
                            "code": 83199889,
                            "name": "红光",

                        },
                        {
                            "code": 2034,
                            "name": "花溪",

                        },
                        {
                            "code": 82774980,
                            "name": "九公里",

                        },
                        {
                            "code": 3089,
                            "name": "界石",

                        },
                        {
                            "code": 1117,
                            "name": "李家沱",

                        },
                        {
                            "code": 34592623,
                            "name": "龙洲湾",

                        },
                        {
                            "code": 56401678,
                            "name": "木洞",

                        },
                        {
                            "code": 63184363,
                            "name": "南彭",

                        },
                        {
                            "code": 3224,
                            "name": "南泉",

                        },
                        {
                            "code": 34602783,
                            "name": "融汇",

                        },
                        {
                            "code": 34569589,
                            "name": "万达广场",

                        },
                        {
                            "code": 34599744,
                            "name": "旭辉城",

                        },
                        {
                            "code": 1031,
                            "name": "鱼洞",

                        }
                    ]
                },
                {
                    "code": 500112,
                    "name": "渝北区",
                    "subLevelModelList": [
                        {
                            "code": 82265708,
                            "name": "北环",

                        },
                        {
                            "code": 34580186,
                            "name": "财富中心",

                        },
                        {
                            "code": 37427589,
                            "name": "翠云",

                        },
                        {
                            "code": 92783795,
                            "name": "茨竹村",

                        },
                        {
                            "code": 82617423,
                            "name": "东和春天",

                        },
                        {
                            "code": 2110,
                            "name": "大竹林",

                        },
                        {
                            "code": 34591666,
                            "name": "光电园",

                        },
                        {
                            "code": 34583109,
                            "name": "国际博览中心",

                        },
                        {
                            "code": 34806738,
                            "name": "花卉园",

                        },
                        {
                            "code": 949,
                            "name": "黄泥塝",

                        },
                        {
                            "code": 35682434,
                            "name": "红旗河沟北",

                        },
                        {
                            "code": 539,
                            "name": "回兴",

                        },
                        {
                            "code": 83043621,
                            "name": "花园新村",

                        },
                        {
                            "code": 55833265,
                            "name": "嘉州",

                        },
                        {
                            "code": 81240066,
                            "name": "加州",

                        },
                        {
                            "code": 34719018,
                            "name": "空港广场",

                        },
                        {
                            "code": 34569103,
                            "name": "空港新城",

                        },
                        {
                            "code": 69001804,
                            "name": "龙湖",

                        },
                        {
                            "code": 83935964,
                            "name": "龙湖江与城",

                        },
                        {
                            "code": 81110992,
                            "name": "龙湖源著",

                        },
                        {
                            "code": 34963979,
                            "name": "礼嘉",

                        },
                        {
                            "code": 83720107,
                            "name": "龙脊广场",

                        },
                        {
                            "code": 2278,
                            "name": "两路",

                        },
                        {
                            "code": 34942168,
                            "name": "鲁能星城",

                        },
                        {
                            "code": 34571446,
                            "name": "龙头寺",

                        },
                        {
                            "code": 427,
                            "name": "龙溪",

                        },
                        {
                            "code": 62923171,
                            "name": "龙兴",

                        },
                        {
                            "code": 63729811,
                            "name": "木耳",

                        },
                        {
                            "code": 34586632,
                            "name": "汽博中心",

                        },
                        {
                            "code": 1096,
                            "name": "人和",

                        },
                        {
                            "code": 1849,
                            "name": "冉家坝",

                        },
                        {
                            "code": 1212,
                            "name": "双凤桥",

                        },
                        {
                            "code": 82158971,
                            "name": "水晶郦城",

                        },
                        {
                            "code": 2156,
                            "name": "松树桥",

                        },
                        {
                            "code": 34905950,
                            "name": "石子山",

                        },
                        {
                            "code": 83593679,
                            "name": "沃尔玛",

                        },
                        {
                            "code": 34588962,
                            "name": "新牌坊",

                        },
                        {
                            "code": 35357751,
                            "name": "西政",

                        },
                        {
                            "code": 82360161,
                            "name": "宜奥(商圈)",

                        },
                        {
                            "code": 36754278,
                            "name": "园博园",

                        },
                        {
                            "code": 34582480,
                            "name": "悦来",

                        },
                        {
                            "code": 37685914,
                            "name": "一碗水",

                        },
                        {
                            "code": 2709,
                            "name": "鸳鸯",

                        },
                        {
                            "code": 83233524,
                            "name": "紫都城",

                        },
                        {
                            "code": 34582608,
                            "name": "中华坊",

                        },
                        {
                            "code": 34569361,
                            "name": "照母山",

                        },
                        {
                            "code": 81907438,
                            "name": "中渝广场",

                        },
                        {
                            "code": 35097679,
                            "name": "中央公园",

                        }
                    ]
                },
                {
                    "code": 500240,
                    "name": "石柱土家族自治县",
                    "subLevelModelList": [
                        {
                            "code": 64479906,
                            "name": "石柱",

                        }
                    ]
                },
                {
                    "code": 500120,
                    "name": "璧山区",
                    "subLevelModelList": [
                        {
                            "code": 35052982,
                            "name": "奥康",

                        },
                        {
                            "code": 64441583,
                            "name": "璧城",

                        },
                        {
                            "code": 64486477,
                            "name": "璧泉",

                        },
                        {
                            "code": 35857603,
                            "name": "璧山客车站",

                        },
                        {
                            "code": 68602989,
                            "name": "丁家",

                        },
                        {
                            "code": 66233742,
                            "name": "大路",

                        },
                        {
                            "code": 35540189,
                            "name": "东林大道",

                        },
                        {
                            "code": 35135142,
                            "name": "红宇大道",

                        },
                        {
                            "code": 71887938,
                            "name": "来凤",

                        },
                        {
                            "code": 35985503,
                            "name": "青杠",

                        },
                        {
                            "code": 112112008,
                            "name": "青龙湖风景区",

                        },
                        {
                            "code": 34954518,
                            "name": "上海城",

                        },
                        {
                            "code": 34811329,
                            "name": "秀湖公园",

                        },
                        {
                            "code": 35637124,
                            "name": "兴旺路",

                        },
                        {
                            "code": 35297763,
                            "name": "瀛嘉天下",

                        }
                    ]
                },
                {
                    "code": 500151,
                    "name": "铜梁区",
                    "subLevelModelList": [
                        {
                            "code": 64626290,
                            "name": "巴川",

                        },
                        {
                            "code": 64690789,
                            "name": "东城",

                        },
                        {
                            "code": 35765678,
                            "name": "老城区",

                        },
                        {
                            "code": 34594364,
                            "name": "新城区",

                        }
                    ]
                },
                {
                    "code": 500156,
                    "name": "武隆区",
                    "subLevelModelList": [
                        {
                            "code": 82239758,
                            "name": "武隆县都市广场",

                        },
                        {
                            "code": 35609745,
                            "name": "仙女山景区",

                        }
                    ]
                },
                {
                    "code": 500155,
                    "name": "梁平区",
                    "subLevelModelList": [
                        {
                            "code": 85689811,
                            "name": "梁平百里竹海观音洞景区",

                        },
                        {
                            "code": 54697928,
                            "name": "梁平区中心城区",

                        }
                    ]
                },
                {
                    "code": 500154,
                    "name": "开州区",
                    "subLevelModelList": [
                        {
                            "code": 69082714,
                            "name": "白鹤",

                        },
                        {
                            "code": 64466354,
                            "name": "汉丰",

                        },
                        {
                            "code": 35108715,
                            "name": "平桥片区",

                        },
                        {
                            "code": 65084665,
                            "name": "文峰",

                        },
                        {
                            "code": 35849733,
                            "name": "新世纪",

                        },
                        {
                            "code": 64692415,
                            "name": "云枫",

                        },
                        {
                            "code": 74906661,
                            "name": "镇东",

                        },
                        {
                            "code": 66321636,
                            "name": "赵家",

                        },
                        {
                            "code": 35009269,
                            "name": "中吉片区",

                        }
                    ]
                },
                {
                    "code": 500153,
                    "name": "荣昌区",
                    "subLevelModelList": [
                        {
                            "code": 36054162,
                            "name": "奥林匹克广场",

                        },
                        {
                            "code": 35325728,
                            "name": "昌龙大道",

                        },
                        {
                            "code": 64562741,
                            "name": "昌元",

                        },
                        {
                            "code": 35610170,
                            "name": "昌州故里",

                        },
                        {
                            "code": 69840118,
                            "name": "富家湾",

                        },
                        {
                            "code": 35558341,
                            "name": "金科世界城",

                        },
                        {
                            "code": 36604996,
                            "name": "九龙",

                        },
                        {
                            "code": 77812871,
                            "name": "雷鸣寺",

                        },
                        {
                            "code": 81222692,
                            "name": "荣昌北站",

                        },
                        {
                            "code": 38869662,
                            "name": "荣昌客运站",

                        },
                        {
                            "code": 36277511,
                            "name": "荣昌棠城医院",

                        },
                        {
                            "code": 35702748,
                            "name": "荣昌体育馆",

                        },
                        {
                            "code": 90414973,
                            "name": "仁义镇",

                        },
                        {
                            "code": 101325796,
                            "name": "双河",

                        },
                        {
                            "code": 34926172,
                            "name": "迎宾大道",

                        },
                        {
                            "code": 74063350,
                            "name": "渝西植物园",

                        },
                        {
                            "code": 38395647,
                            "name": "重百",

                        }
                    ]
                },
                {
                    "code": 500152,
                    "name": "潼南区",
                    "subLevelModelList": [
                        {
                            "code": 64449389,
                            "name": "桂林",

                        },
                        {
                            "code": 34769086,
                            "name": "华堂购物中心",

                        },
                        {
                            "code": 35293764,
                            "name": "外滩国际城",

                        },
                        {
                            "code": 85005504,
                            "name": "站前大道",

                        },
                        {
                            "code": 64475494,
                            "name": "梓潼",

                        }
                    ]
                }
            ],
        "shenzhen": [
                {
                    "code": 440303,
                    "name": "罗湖区",
                    "subLevelModelList": [
                        {
                            "code": 34583731,
                            "name": "宝安南路沿线",

                        },
                        {
                            "code": 410,
                            "name": "布吉",

                        },
                        {
                            "code": 82236535,
                            "name": "百仕达",

                        },
                        {
                            "code": 1193,
                            "name": "布心",

                        },
                        {
                            "code": 81617097,
                            "name": "春风路",

                        },
                        {
                            "code": 82643267,
                            "name": "春风万佳",

                        },
                        {
                            "code": 3756,
                            "name": "草埔",

                        },
                        {
                            "code": 2296,
                            "name": "蔡屋围",

                        },
                        {
                            "code": 1461,
                            "name": "翠竹",

                        },
                        {
                            "code": 325,
                            "name": "东湖",

                        },
                        {
                            "code": 126,
                            "name": "东门",

                        },
                        {
                            "code": 34576614,
                            "name": "地王",

                        },
                        {
                            "code": 7644,
                            "name": "东晓",

                        },
                        {
                            "code": 576,
                            "name": "国贸",

                        },
                        {
                            "code": 64534783,
                            "name": "黄贝",

                        },
                        {
                            "code": 331,
                            "name": "火车站",

                        },
                        {
                            "code": 2760,
                            "name": "洪湖",

                        },
                        {
                            "code": 83276325,
                            "name": "金稻田",

                        },
                        {
                            "code": 82901878,
                            "name": "罗芳",

                        },
                        {
                            "code": 83086053,
                            "name": "罗湖口岸",

                        },
                        {
                            "code": 82489993,
                            "name": "螺岭",

                        },
                        {
                            "code": 658,
                            "name": "莲塘",

                        },
                        {
                            "code": 981,
                            "name": "泥岗",

                        },
                        {
                            "code": 1928,
                            "name": "清水河",

                        },
                        {
                            "code": 3105,
                            "name": "人民南",

                        },
                        {
                            "code": 1285,
                            "name": "水贝",

                        },
                        {
                            "code": 671,
                            "name": "笋岗",

                        },
                        {
                            "code": 7569,
                            "name": "水库",

                        },
                        {
                            "code": 1108,
                            "name": "田贝",

                        },
                        {
                            "code": 1050,
                            "name": "文锦渡",

                        },
                        {
                            "code": 35439649,
                            "name": "梧桐山",

                        },
                        {
                            "code": 34572609,
                            "name": "万象城",

                        },
                        {
                            "code": 82405473,
                            "name": "喜荟城",

                        },
                        {
                            "code": 34774057,
                            "name": "新秀",

                        },
                        {
                            "code": 3025,
                            "name": "银湖",

                        },
                        {
                            "code": 1465,
                            "name": "园岭",

                        }
                    ]
                },
                {
                    "code": 440310,
                    "name": "坪山区",
                    "subLevelModelList": [
                        {
                            "code": 81245798,
                            "name": "淡水",

                        },
                        {
                            "code": 34576322,
                            "name": "坑梓",

                        },
                        {
                            "code": 10018,
                            "name": "坪山",

                        },
                        {
                            "code": 82452613,
                            "name": "竹坑",

                        }
                    ]
                },
                {
                    "code": 440311,
                    "name": "光明区",
                    "subLevelModelList": [
                        {
                            "code": 82045946,
                            "name": "长圳",

                        },
                        {
                            "code": 34419579,
                            "name": "光明",

                        },
                        {
                            "code": 34575091,
                            "name": "公明",

                        },
                        {
                            "code": 34593303,
                            "name": "田寮",

                        },
                        {
                            "code": 34639803,
                            "name": "西田",

                        },
                        {
                            "code": 34732093,
                            "name": "圳美",

                        }
                    ]
                },
                {
                    "code": 440308,
                    "name": "盐田区",
                    "subLevelModelList": [
                        {
                            "code": 35869492,
                            "name": "东部华侨城",

                        },
                        {
                            "code": 34720664,
                            "name": "梅沙",

                        },
                        {
                            "code": 1352,
                            "name": "沙头角",

                        },
                        {
                            "code": 106261694,
                            "name": "梧桐山",

                        },
                        {
                            "code": 82245973,
                            "name": "壹海城",

                        },
                        {
                            "code": 34822531,
                            "name": "盐田港",

                        },
                        {
                            "code": 34621114,
                            "name": "盐田海鲜食街",

                        }
                    ]
                },
                {
                    "code": 440309,
                    "name": "龙华区",
                    "subLevelModelList": [
                        {
                            "code": 10020,
                            "name": "坂田",

                        },
                        {
                            "code": 34570190,
                            "name": "大浪",

                        },
                        {
                            "code": 10014,
                            "name": "观澜",

                        },
                        {
                            "code": 10010,
                            "name": "龙华",

                        },
                        {
                            "code": 34575944,
                            "name": "梅林关",

                        },
                        {
                            "code": 10009,
                            "name": "民治",

                        },
                        {
                            "code": 81193234,
                            "name": "清湖",

                        },
                        {
                            "code": 81502235,
                            "name": "三联",

                        },
                        {
                            "code": 49027060,
                            "name": "上塘",

                        },
                        {
                            "code": 34634401,
                            "name": "深圳北站",

                        },
                        {
                            "code": 82496097,
                            "name": "万众城",

                        },
                        {
                            "code": 82503388,
                            "name": "油松",

                        }
                    ]
                },
                {
                    "code": 440306,
                    "name": "宝安区",
                    "subLevelModelList": [
                        {
                            "code": 34576957,
                            "name": "宝安机场",

                        },
                        {
                            "code": 34566666,
                            "name": "宝安中心区",

                        },
                        {
                            "code": 48656648,
                            "name": "碧海",

                        },
                        {
                            "code": 82677489,
                            "name": "宝立方",

                        },
                        {
                            "code": 81171533,
                            "name": "宝体",

                        },
                        {
                            "code": 82201645,
                            "name": "长安大润发",

                        },
                        {
                            "code": 69033659,
                            "name": "长安镇区",

                        },
                        {
                            "code": 34569936,
                            "name": "翻身",

                        },
                        {
                            "code": 590,
                            "name": "福永",

                        },
                        {
                            "code": 82374686,
                            "name": "港隆城",

                        },
                        {
                            "code": 72575537,
                            "name": "公明",

                        },
                        {
                            "code": 34698936,
                            "name": "固戍",

                        },
                        {
                            "code": 34977875,
                            "name": "罗田",

                        },
                        {
                            "code": 57451716,
                            "name": "时代城",

                        },
                        {
                            "code": 1591,
                            "name": "松岗",

                        },
                        {
                            "code": 140,
                            "name": "沙井",

                        },
                        {
                            "code": 1134,
                            "name": "石岩",

                        },
                        {
                            "code": 81622879,
                            "name": "天虹汇一城",

                        },
                        {
                            "code": 1038,
                            "name": "桃源居",

                        },
                        {
                            "code": 502,
                            "name": "新安",

                        },
                        {
                            "code": 34579105,
                            "name": "曦城",

                        },
                        {
                            "code": 342,
                            "name": "西乡",

                        },
                        {
                            "code": 81879375,
                            "name": "燕川",

                        }
                    ]
                },
                {
                    "code": 440307,
                    "name": "龙岗区",
                    "subLevelModelList": [
                        {
                            "code": 83051805,
                            "name": "奥特莱斯",

                        },
                        {
                            "code": 421,
                            "name": "布吉",

                        },
                        {
                            "code": 92,
                            "name": "坂田",

                        },
                        {
                            "code": 7471,
                            "name": "草埔",

                        },
                        {
                            "code": 34580485,
                            "name": "大芬",

                        },
                        {
                            "code": 34975636,
                            "name": "大鹏半岛",

                        },
                        {
                            "code": 81466258,
                            "name": "大鹏所城",

                        },
                        {
                            "code": 34568924,
                            "name": "大运",

                        },
                        {
                            "code": 81298763,
                            "name": "东站",

                        },
                        {
                            "code": 48768277,
                            "name": "丹竹头",

                        },
                        {
                            "code": 34585869,
                            "name": "官湖",

                        },
                        {
                            "code": 34740472,
                            "name": "岗头",

                        },
                        {
                            "code": 313,
                            "name": "横岗",

                        },
                        {
                            "code": 34795214,
                            "name": "华南城",

                        },
                        {
                            "code": 82817585,
                            "name": "华为坂田基地",

                        },
                        {
                            "code": 35374818,
                            "name": "较场尾",

                        },
                        {
                            "code": 99931726,
                            "name": "桔钓沙",

                        },
                        {
                            "code": 2493,
                            "name": "康桥",

                        },
                        {
                            "code": 2850,
                            "name": "葵涌",

                        },
                        {
                            "code": 83949014,
                            "name": "可园",

                        },
                        {
                            "code": 34583705,
                            "name": "罗岗",

                        },
                        {
                            "code": 35040786,
                            "name": "龙岗宝荷",

                        },
                        {
                            "code": 81106206,
                            "name": "龙岗老街",

                        },
                        {
                            "code": 34570453,
                            "name": "龙岗中心城",

                        },
                        {
                            "code": 34569179,
                            "name": "李朗聚星商城",

                        },
                        {
                            "code": 34575097,
                            "name": "慢城",

                        },
                        {
                            "code": 88727455,
                            "name": "民营市场",

                        },
                        {
                            "code": 35162090,
                            "name": "南澳",

                        },
                        {
                            "code": 34566515,
                            "name": "南联",

                        },
                        {
                            "code": 34646884,
                            "name": "南岭",

                        },
                        {
                            "code": 1035,
                            "name": "坪地",

                        },
                        {
                            "code": 1028,
                            "name": "平湖",

                        },
                        {
                            "code": 85472829,
                            "name": "求水山",

                        },
                        {
                            "code": 34569968,
                            "name": "双龙",

                        },
                        {
                            "code": 80977928,
                            "name": "世贸",

                        },
                        {
                            "code": 35628221,
                            "name": "水头",

                        },
                        {
                            "code": 89252421,
                            "name": "石芽岭",

                        },
                        {
                            "code": 82334659,
                            "name": "天虹",

                        },
                        {
                            "code": 82302857,
                            "name": "五和",

                        },
                        {
                            "code": 34584084,
                            "name": "万科广场",

                        },
                        {
                            "code": 82807055,
                            "name": "雪象",

                        },
                        {
                            "code": 61728952,
                            "name": "溪涌",

                        },
                        {
                            "code": 81004263,
                            "name": "杨美",

                        },
                        {
                            "code": 81294959,
                            "name": "雁田",

                        }
                    ]
                },
                {
                    "code": 440304,
                    "name": "福田区",
                    "subLevelModelList": [
                        {
                            "code": 306,
                            "name": "八卦岭",

                        },
                        {
                            "code": 81130360,
                            "name": "百花",

                        },
                        {
                            "code": 34573116,
                            "name": "保税区",

                        },
                        {
                            "code": 25,
                            "name": "车公庙",

                        },
                        {
                            "code": 2548,
                            "name": "赤尾",

                        },
                        {
                            "code": 99277695,
                            "name": "福田保税区",

                        },
                        {
                            "code": 55695551,
                            "name": "福田中心",

                        },
                        {
                            "code": 488,
                            "name": "岗厦",

                        },
                        {
                            "code": 1707,
                            "name": "购物公园",

                        },
                        {
                            "code": 760,
                            "name": "皇岗",

                        },
                        {
                            "code": 34834943,
                            "name": "黄木岗",

                        },
                        {
                            "code": 2823,
                            "name": "华强北",

                        },
                        {
                            "code": 34571638,
                            "name": "华强南",

                        },
                        {
                            "code": 34659124,
                            "name": "会展中心",

                        },
                        {
                            "code": 628,
                            "name": "景田",

                        },
                        {
                            "code": 34575836,
                            "name": "莲花",

                        },
                        {
                            "code": 597,
                            "name": "梅林",

                        },
                        {
                            "code": 176,
                            "name": "上步",

                        },
                        {
                            "code": 1560,
                            "name": "笋岗",

                        },
                        {
                            "code": 58129989,
                            "name": "市民中心",

                        },
                        {
                            "code": 70,
                            "name": "石厦",

                        },
                        {
                            "code": 3664,
                            "name": "上沙",

                        },
                        {
                            "code": 574,
                            "name": "沙头",

                        },
                        {
                            "code": 7608,
                            "name": "沙尾",

                        },
                        {
                            "code": 81882660,
                            "name": "水围",

                        },
                        {
                            "code": 80999013,
                            "name": "沙尾村",

                        },
                        {
                            "code": 3531,
                            "name": "沙嘴",

                        },
                        {
                            "code": 69239487,
                            "name": "万象城",

                        },
                        {
                            "code": 81168743,
                            "name": "新城市广场",

                        },
                        {
                            "code": 223,
                            "name": "香蜜湖",

                        },
                        {
                            "code": 549,
                            "name": "下沙",

                        },
                        {
                            "code": 1048,
                            "name": "新洲",

                        },
                        {
                            "code": 429,
                            "name": "园岭",

                        },
                        {
                            "code": 293,
                            "name": "竹子林",

                        }
                    ]
                },
                {
                    "code": 440305,
                    "name": "南山区",
                    "subLevelModelList": [
                        {
                            "code": 82714150,
                            "name": "保利",

                        },
                        {
                            "code": 1546,
                            "name": "白石洲",

                        },
                        {
                            "code": 395,
                            "name": "大冲",

                        },
                        {
                            "code": 34886744,
                            "name": "大学城",

                        },
                        {
                            "code": 82568012,
                            "name": "桂庙路口",

                        },
                        {
                            "code": 56493087,
                            "name": "海岸城",

                        },
                        {
                            "code": 286,
                            "name": "后海",

                        },
                        {
                            "code": 57848680,
                            "name": "欢乐海岸",

                        },
                        {
                            "code": 341,
                            "name": "华侨城",

                        },
                        {
                            "code": 1469,
                            "name": "海上世界",

                        },
                        {
                            "code": 67557370,
                            "name": "红树湾",

                        },
                        {
                            "code": 81187931,
                            "name": "海雅百货",

                        },
                        {
                            "code": 64611832,
                            "name": "花园城",

                        },
                        {
                            "code": 22,
                            "name": "科技园",

                        },
                        {
                            "code": 55581076,
                            "name": "南山京基百纳",

                        },
                        {
                            "code": 34570037,
                            "name": "南山中心",

                        },
                        {
                            "code": 351,
                            "name": "南头",

                        },
                        {
                            "code": 529,
                            "name": "南油",

                        },
                        {
                            "code": 647,
                            "name": "前海",

                        },
                        {
                            "code": 81464342,
                            "name": "世界之窗",

                        },
                        {
                            "code": 94,
                            "name": "蛇口",

                        },
                        {
                            "code": 643,
                            "name": "深圳湾",

                        },
                        {
                            "code": 56000515,
                            "name": "太古城",

                        },
                        {
                            "code": 81695424,
                            "name": "桃园",

                        },
                        {
                            "code": 317,
                            "name": "西丽",

                        },
                        {
                            "code": 83295208,
                            "name": "益田假日",

                        }
                    ]
                }
            ],
        "guangzhou":[
                {
                    "code": 440103,
                    "name": "荔湾区",
                    "subLevelModelList": [
                        {
                            "code": 2410,
                            "name": "彩虹",

                        },
                        {
                            "code": 49129854,
                            "name": "茶滘",

                        },
                        {
                            "code": 1725,
                            "name": "陈家祠",

                        },
                        {
                            "code": 3544,
                            "name": "多宝",

                        },
                        {
                            "code": 34621331,
                            "name": "东塱",

                        },
                        {
                            "code": 67480506,
                            "name": "大坦沙",

                        },
                        {
                            "code": 415,
                            "name": "芳村",

                        },
                        {
                            "code": 39534855,
                            "name": "工业大道",

                        },
                        {
                            "code": 34594530,
                            "name": "鹤洞",

                        },
                        {
                            "code": 68212344,
                            "name": "花地湾",

                        },
                        {
                            "code": 63067957,
                            "name": "华林",

                        },
                        {
                            "code": 34572321,
                            "name": "黄沙",

                        },
                        {
                            "code": 81850074,
                            "name": "河沙",

                        },
                        {
                            "code": 92459590,
                            "name": "环市西",

                        },
                        {
                            "code": 2125,
                            "name": "金花",

                        },
                        {
                            "code": 35316763,
                            "name": "滘口",

                        },
                        {
                            "code": 34800943,
                            "name": "坑口",

                        },
                        {
                            "code": 35297914,
                            "name": "康王路",

                        },
                        {
                            "code": 1869,
                            "name": "流花",

                        },
                        {
                            "code": 2524,
                            "name": "龙津",

                        },
                        {
                            "code": 1217,
                            "name": "龙溪",

                        },
                        {
                            "code": 81312032,
                            "name": "南岸路",

                        },
                        {
                            "code": 2395,
                            "name": "南源",

                        },
                        {
                            "code": 57025516,
                            "name": "平洲",

                        },
                        {
                            "code": 2345,
                            "name": "桥中",

                        },
                        {
                            "code": 48826859,
                            "name": "人民路",

                        },
                        {
                            "code": 3069,
                            "name": "沙面",

                        },
                        {
                            "code": 34622683,
                            "name": "上下九",

                        },
                        {
                            "code": 81293474,
                            "name": "松洲",

                        },
                        {
                            "code": 34876141,
                            "name": "坦尾",

                        },
                        {
                            "code": 82349362,
                            "name": "西村西场",

                        },
                        {
                            "code": 3564,
                            "name": "西关",

                        },
                        {
                            "code": 5764,
                            "name": "沿江路",

                        },
                        {
                            "code": 82178638,
                            "name": "周门村",

                        },
                        {
                            "code": 2209,
                            "name": "站前",

                        },
                        {
                            "code": 53124611,
                            "name": "中山八",

                        },
                        {
                            "code": 34573632,
                            "name": "中山六路",

                        },
                        {
                            "code": 82189269,
                            "name": "中山七八路",

                        }
                    ]
                },
                {
                    "code": 440111,
                    "name": "白云区",
                    "subLevelModelList": [
                        {
                            "code": 50333207,
                            "name": "北兴",

                        },
                        {
                            "code": 534,
                            "name": "白云大道",

                        },
                        {
                            "code": 34569139,
                            "name": "白云大道北",

                        },
                        {
                            "code": 81855075,
                            "name": "白云大道南",

                        },
                        {
                            "code": 34628600,
                            "name": "白云国际机场",

                        },
                        {
                            "code": 65361455,
                            "name": "白云绿地中心",

                        },
                        {
                            "code": 36873758,
                            "name": "白云山风景区",

                        },
                        {
                            "code": 84192309,
                            "name": "城市广场",

                        },
                        {
                            "code": 81498373,
                            "name": "大金钟",

                        },
                        {
                            "code": 35650747,
                            "name": "桂花岗",

                        },
                        {
                            "code": 34580547,
                            "name": "广园路",

                        },
                        {
                            "code": 81180444,
                            "name": "广园新村",

                        },
                        {
                            "code": 55600705,
                            "name": "黄边",

                        },
                        {
                            "code": 538,
                            "name": "黄石",

                        },
                        {
                            "code": 938,
                            "name": "机场路",

                        },
                        {
                            "code": 44,
                            "name": "江高",

                        },
                        {
                            "code": 239,
                            "name": "嘉禾",

                        },
                        {
                            "code": 2063,
                            "name": "均禾",

                        },
                        {
                            "code": 38302842,
                            "name": "旧区",

                        },
                        {
                            "code": 1165,
                            "name": "金沙洲",

                        },
                        {
                            "code": 1210,
                            "name": "景泰",

                        },
                        {
                            "code": 296,
                            "name": "京溪",

                        },
                        {
                            "code": 1714,
                            "name": "罗冲围",

                        },
                        {
                            "code": 432,
                            "name": "龙归",

                        },
                        {
                            "code": 7051,
                            "name": "里水",

                        },
                        {
                            "code": 2761,
                            "name": "良田",

                        },
                        {
                            "code": 69050924,
                            "name": "梅花园",

                        },
                        {
                            "code": 34668984,
                            "name": "南湖",

                        },
                        {
                            "code": 131,
                            "name": "人和",

                        },
                        {
                            "code": 7698,
                            "name": "沙东",

                        },
                        {
                            "code": 34569877,
                            "name": "石井",

                        },
                        {
                            "code": 3271,
                            "name": "神山",

                        },
                        {
                            "code": 55623219,
                            "name": "沙太北",

                        },
                        {
                            "code": 56069533,
                            "name": "沙太南",

                        },
                        {
                            "code": 195,
                            "name": "三元里",

                        },
                        {
                            "code": 1713,
                            "name": "松洲",

                        },
                        {
                            "code": 1197,
                            "name": "同德",

                        },
                        {
                            "code": 718,
                            "name": "同和",

                        },
                        {
                            "code": 923,
                            "name": "太和",

                        },
                        {
                            "code": 1615,
                            "name": "棠景",

                        },
                        {
                            "code": 10479,
                            "name": "太平",

                        },
                        {
                            "code": 58435728,
                            "name": "万达广场",

                        },
                        {
                            "code": 81147465,
                            "name": "五号停机坪",

                        },
                        {
                            "code": 34570086,
                            "name": "新市",

                        },
                        {
                            "code": 3086,
                            "name": "元岗",

                        },
                        {
                            "code": 720,
                            "name": "永平",

                        },
                        {
                            "code": 69950010,
                            "name": "永泰",

                        },
                        {
                            "code": 2164,
                            "name": "竹料",

                        },
                        {
                            "code": 734,
                            "name": "钟落潭",

                        }
                    ]
                },
                {
                    "code": 440106,
                    "name": "天河区",
                    "subLevelModelList": [
                        {
                            "code": 202,
                            "name": "车陂",

                        },
                        {
                            "code": 34569880,
                            "name": "岑村",

                        },
                        {
                            "code": 2072,
                            "name": "长兴",

                        },
                        {
                            "code": 6072,
                            "name": "登峰",

                        },
                        {
                            "code": 34845138,
                            "name": "东风东",

                        },
                        {
                            "code": 81082327,
                            "name": "东莞庄",

                        },
                        {
                            "code": 7740,
                            "name": "东湖",

                        },
                        {
                            "code": 599,
                            "name": "东圃",

                        },
                        {
                            "code": 7519,
                            "name": "岗顶",

                        },
                        {
                            "code": 81845812,
                            "name": "高德置地",

                        },
                        {
                            "code": 34576158,
                            "name": "高唐",

                        },
                        {
                            "code": 81035000,
                            "name": "广州东站",

                        },
                        {
                            "code": 578,
                            "name": "黄村",

                        },
                        {
                            "code": 64478197,
                            "name": "花城汇",

                        },
                        {
                            "code": 34571376,
                            "name": "华景新城",

                        },
                        {
                            "code": 81032571,
                            "name": "汇景新城",

                        },
                        {
                            "code": 82448336,
                            "name": "火炉山",

                        },
                        {
                            "code": 7705,
                            "name": "京溪",

                        },
                        {
                            "code": 61145617,
                            "name": "柯木塱村",

                        },
                        {
                            "code": 34579051,
                            "name": "科学城",

                        },
                        {
                            "code": 2745,
                            "name": "龙洞",

                        },
                        {
                            "code": 7084,
                            "name": "猎德",

                        },
                        {
                            "code": 897,
                            "name": "林和",

                        },
                        {
                            "code": 1423,
                            "name": "龙口",

                        },
                        {
                            "code": 81572645,
                            "name": "龙口西",

                        },
                        {
                            "code": 34575232,
                            "name": "跑马场",

                        },
                        {
                            "code": 7545,
                            "name": "前进",

                        },
                        {
                            "code": 456,
                            "name": "沙东",

                        },
                        {
                            "code": 170,
                            "name": "沙河",

                        },
                        {
                            "code": 207,
                            "name": "石牌",

                        },
                        {
                            "code": 81631320,
                            "name": "上社",

                        },
                        {
                            "code": 66003085,
                            "name": "时尚天河",

                        },
                        {
                            "code": 56299350,
                            "name": "沙太南",

                        },
                        {
                            "code": 34718920,
                            "name": "同和",

                        },
                        {
                            "code": 655,
                            "name": "天河北",

                        },
                        {
                            "code": 1009,
                            "name": "天河城",

                        },
                        {
                            "code": 627,
                            "name": "天河公园",

                        },
                        {
                            "code": 52486943,
                            "name": "天河客运站",

                        },
                        {
                            "code": 55553810,
                            "name": "天平架",

                        },
                        {
                            "code": 82788807,
                            "name": "天润路",

                        },
                        {
                            "code": 75,
                            "name": "棠下",

                        },
                        {
                            "code": 62901797,
                            "name": "天园",

                        },
                        {
                            "code": 281,
                            "name": "体育中心",

                        },
                        {
                            "code": 747,
                            "name": "五山",

                        },
                        {
                            "code": 3536,
                            "name": "冼村",

                        },
                        {
                            "code": 541,
                            "name": "兴华",

                        },
                        {
                            "code": 68969583,
                            "name": "兴盛路",

                        },
                        {
                            "code": 34569698,
                            "name": "小新塘",

                        },
                        {
                            "code": 435,
                            "name": "员村",

                        },
                        {
                            "code": 353,
                            "name": "元岗",

                        },
                        {
                            "code": 2008,
                            "name": "粤垦",

                        },
                        {
                            "code": 34571039,
                            "name": "燕岭",

                        },
                        {
                            "code": 7549,
                            "name": "鱼珠",

                        },
                        {
                            "code": 36716677,
                            "name": "正佳广场",

                        },
                        {
                            "code": 1194,
                            "name": "珠江新城",

                        },
                        {
                            "code": 53350763,
                            "name": "珠江新城东",

                        },
                        {
                            "code": 85737009,
                            "name": "珠江新城西",

                        }
                    ]
                },
                {
                    "code": 440104,
                    "name": "越秀区",
                    "subLevelModelList": [
                        {
                            "code": 261,
                            "name": "北京路",

                        },
                        {
                            "code": 82288031,
                            "name": "赤岗",

                        },
                        {
                            "code": 1211,
                            "name": "东川",

                        },
                        {
                            "code": 332,
                            "name": "大东",

                        },
                        {
                            "code": 1291,
                            "name": "登峰",

                        },
                        {
                            "code": 7565,
                            "name": "东风东",

                        },
                        {
                            "code": 34569727,
                            "name": "东风西",

                        },
                        {
                            "code": 905,
                            "name": "东风中路",

                        },
                        {
                            "code": 7577,
                            "name": "东湖",

                        },
                        {
                            "code": 2222,
                            "name": "东山口",

                        },
                        {
                            "code": 82299740,
                            "name": "动物园",

                        },
                        {
                            "code": 7552,
                            "name": "大新",

                        },
                        {
                            "code": 1532,
                            "name": "二沙岛",

                        },
                        {
                            "code": 1416,
                            "name": "广卫",

                        },
                        {
                            "code": 57789795,
                            "name": "广园东",

                        },
                        {
                            "code": 34569528,
                            "name": "火车站",

                        },
                        {
                            "code": 935,
                            "name": "黄花岗",

                        },
                        {
                            "code": 93,
                            "name": "华乐",

                        },
                        {
                            "code": 1215,
                            "name": "环市东",

                        },
                        {
                            "code": 82034574,
                            "name": "环市中",

                        },
                        {
                            "code": 34633723,
                            "name": "海珠广场",

                        },
                        {
                            "code": 1616,
                            "name": "解放北",

                        },
                        {
                            "code": 99281194,
                            "name": "建设路",

                        },
                        {
                            "code": 107784160,
                            "name": "景泰",

                        },
                        {
                            "code": 62902484,
                            "name": "矿泉",

                        },
                        {
                            "code": 589,
                            "name": "流花",

                        },
                        {
                            "code": 34593822,
                            "name": "麓湖公园",

                        },
                        {
                            "code": 49020531,
                            "name": "麓景",

                        },
                        {
                            "code": 2789,
                            "name": "六榕",

                        },
                        {
                            "code": 1125,
                            "name": "农林下路",

                        },
                        {
                            "code": 84067169,
                            "name": "盘福",

                        },
                        {
                            "code": 81097488,
                            "name": "区庄",

                        },
                        {
                            "code": 2805,
                            "name": "人民北路",

                        },
                        {
                            "code": 93295766,
                            "name": "人民路",

                        },
                        {
                            "code": 1621,
                            "name": "沙东",

                        },
                        {
                            "code": 6168,
                            "name": "沙河",

                        },
                        {
                            "code": 36652312,
                            "name": "上下九",

                        },
                        {
                            "code": 487,
                            "name": "水荫",

                        },
                        {
                            "code": 948,
                            "name": "三元里",

                        },
                        {
                            "code": 7414,
                            "name": "同德",

                        },
                        {
                            "code": 81023213,
                            "name": "天河北",

                        },
                        {
                            "code": 3414,
                            "name": "淘金",

                        },
                        {
                            "code": 7528,
                            "name": "五羊新城",

                        },
                        {
                            "code": 2094,
                            "name": "小北",

                        },
                        {
                            "code": 10420,
                            "name": "西关",

                        },
                        {
                            "code": 49028012,
                            "name": "西门口",

                        },
                        {
                            "code": 34588766,
                            "name": "杨箕",

                        },
                        {
                            "code": 2048,
                            "name": "沿江路",

                        },
                        {
                            "code": 1564,
                            "name": "越秀公园",

                        },
                        {
                            "code": 57444689,
                            "name": "越秀南",

                        },
                        {
                            "code": 65765385,
                            "name": "中华广场",

                        },
                        {
                            "code": 82371964,
                            "name": "中山二三路",

                        },
                        {
                            "code": 570,
                            "name": "中山六路",

                        }
                    ]
                },
                {
                    "code": 440105,
                    "name": "海珠区",
                    "subLevelModelList": [
                        {
                            "code": 1436,
                            "name": "宝岗",

                        },
                        {
                            "code": 84504402,
                            "name": "滨江东",

                        },
                        {
                            "code": 1940,
                            "name": "滨江路沿线",

                        },
                        {
                            "code": 809,
                            "name": "赤岗",

                        },
                        {
                            "code": 1160,
                            "name": "昌岗",

                        },
                        {
                            "code": 1446,
                            "name": "东晓",

                        },
                        {
                            "code": 58618163,
                            "name": "东晓南",

                        },
                        {
                            "code": 108,
                            "name": "凤阳",

                        },
                        {
                            "code": 572,
                            "name": "工业大道",

                        },
                        {
                            "code": 55559512,
                            "name": "工业大道北",

                        },
                        {
                            "code": 48810319,
                            "name": "工业大道南",

                        },
                        {
                            "code": 3467,
                            "name": "官洲",

                        },
                        {
                            "code": 1055,
                            "name": "广州大道南",

                        },
                        {
                            "code": 925,
                            "name": "海幢",

                        },
                        {
                            "code": 1989,
                            "name": "华洲",

                        },
                        {
                            "code": 82718930,
                            "name": "金碧",

                        },
                        {
                            "code": 62915080,
                            "name": "江海",

                        },
                        {
                            "code": 100,
                            "name": "江南大道",

                        },
                        {
                            "code": 34630614,
                            "name": "江南西",

                        },
                        {
                            "code": 62908518,
                            "name": "江南中",

                        },
                        {
                            "code": 49254011,
                            "name": "江燕路",

                        },
                        {
                            "code": 990,
                            "name": "客村",

                        },
                        {
                            "code": 996,
                            "name": "龙凤",

                        },
                        {
                            "code": 81019910,
                            "name": "沥滘",

                        },
                        {
                            "code": 3054,
                            "name": "南华西",

                        },
                        {
                            "code": 2449,
                            "name": "南石头",

                        },
                        {
                            "code": 1710,
                            "name": "南洲",

                        },
                        {
                            "code": 653,
                            "name": "琶洲",

                        },
                        {
                            "code": 95600489,
                            "name": "前进",

                        },
                        {
                            "code": 830,
                            "name": "前进路",

                        },
                        {
                            "code": 507,
                            "name": "瑞宝",

                        },
                        {
                            "code": 6407,
                            "name": "素社",

                        },
                        {
                            "code": 83279180,
                            "name": "同福",

                        },
                        {
                            "code": 889,
                            "name": "晓港",

                        },
                        {
                            "code": 81519927,
                            "name": "新港东",

                        },
                        {
                            "code": 661,
                            "name": "新港西路沿线",

                        },
                        {
                            "code": 36482075,
                            "name": "瀛洲",

                        },
                        {
                            "code": 81505228,
                            "name": "中大",

                        }
                    ]
                },
                {
                    "code": 440118,
                    "name": "增城区",
                    "subLevelModelList": [
                        {
                            "code": 82454819,
                            "name": "东汇城",

                        },
                        {
                            "code": 6561,
                            "name": "福和",

                        },
                        {
                            "code": 34572984,
                            "name": "凤凰城",

                        },
                        {
                            "code": 82532770,
                            "name": "凯旋门",

                        },
                        {
                            "code": 2022,
                            "name": "荔城",

                        },
                        {
                            "code": 7370,
                            "name": "荔联",

                        },
                        {
                            "code": 3511,
                            "name": "派潭",

                        },
                        {
                            "code": 3656,
                            "name": "三江",

                        },
                        {
                            "code": 34737894,
                            "name": "沙埔镇",

                        },
                        {
                            "code": 35200093,
                            "name": "石滩镇",

                        },
                        {
                            "code": 82113586,
                            "name": "石湾",

                        },
                        {
                            "code": 34997081,
                            "name": "沙庄",

                        },
                        {
                            "code": 82042055,
                            "name": "太阳城",

                        },
                        {
                            "code": 81519265,
                            "name": "万达广场",

                        },
                        {
                            "code": 1480,
                            "name": "仙村",

                        },
                        {
                            "code": 85666277,
                            "name": "新好景",

                        },
                        {
                            "code": 83787944,
                            "name": "小楼镇",

                        },
                        {
                            "code": 1238,
                            "name": "新塘广场",

                        },
                        {
                            "code": 2247,
                            "name": "永和",

                        },
                        {
                            "code": 2571,
                            "name": "朱村",

                        },
                        {
                            "code": 36996726,
                            "name": "正果",

                        },
                        {
                            "code": 35990948,
                            "name": "增江",

                        },
                        {
                            "code": 2699,
                            "name": "中新",

                        }
                    ]
                },
                {
                    "code": 440117,
                    "name": "从化区",
                    "subLevelModelList": [
                        {
                            "code": 35213767,
                            "name": "鳌头",

                        },
                        {
                            "code": 37583459,
                            "name": "碧水湾",

                        },
                        {
                            "code": 96245399,
                            "name": "白水寨",

                        },
                        {
                            "code": 2655,
                            "name": "城郊",

                        },
                        {
                            "code": 3020,
                            "name": "街口",

                        },
                        {
                            "code": 1450,
                            "name": "江埔",

                        },
                        {
                            "code": 7202,
                            "name": "良口",

                        },
                        {
                            "code": 3389,
                            "name": "太平",

                        },
                        {
                            "code": 34616579,
                            "name": "旺城",

                        },
                        {
                            "code": 10110,
                            "name": "温泉",

                        },
                        {
                            "code": 82556707,
                            "name": "欣荣宏广场",

                        },
                        {
                            "code": 84334568,
                            "name": "新世纪广场",

                        },
                        {
                            "code": 36723422,
                            "name": "溪头村",

                        }
                    ]
                },
                {
                    "code": 440114,
                    "name": "花都区",
                    "subLevelModelList": [
                        {
                            "code": 81496532,
                            "name": "保利花城",

                        },
                        {
                            "code": 82520614,
                            "name": "百寿路",

                        },
                        {
                            "code": 9378,
                            "name": "北兴",

                        },
                        {
                            "code": 34579557,
                            "name": "白云国际机场",

                        },
                        {
                            "code": 34628287,
                            "name": "北站",

                        },
                        {
                            "code": 6933,
                            "name": "赤坭",

                        },
                        {
                            "code": 34591774,
                            "name": "大润发",

                        },
                        {
                            "code": 82371231,
                            "name": "芙蓉",

                        },
                        {
                            "code": 1025,
                            "name": "花东",

                        },
                        {
                            "code": 55629955,
                            "name": "花都广场",

                        },
                        {
                            "code": 55562907,
                            "name": "花都体育场",

                        },
                        {
                            "code": 506,
                            "name": "花山",

                        },
                        {
                            "code": 34585141,
                            "name": "旧区",

                        },
                        {
                            "code": 34589987,
                            "name": "建设北路",

                        },
                        {
                            "code": 99422792,
                            "name": "建设路",

                        },
                        {
                            "code": 34598736,
                            "name": "莲塘",

                        },
                        {
                            "code": 34585455,
                            "name": "马溪",

                        },
                        {
                            "code": 81839939,
                            "name": "区政府",

                        },
                        {
                            "code": 151028024,
                            "name": "石角镇",

                        },
                        {
                            "code": 34588622,
                            "name": "狮岭",

                        },
                        {
                            "code": 35213806,
                            "name": "山前大道",

                        },
                        {
                            "code": 3111,
                            "name": "炭步",

                        },
                        {
                            "code": 34586540,
                            "name": "铁路西",

                        },
                        {
                            "code": 34609810,
                            "name": "新区",

                        },
                        {
                            "code": 34601767,
                            "name": "秀全公园",

                        },
                        {
                            "code": 55866722,
                            "name": "新世纪广场",

                        },
                        {
                            "code": 34574109,
                            "name": "雅居乐锦城",

                        },
                        {
                            "code": 34573410,
                            "name": "饮食风情街",

                        },
                        {
                            "code": 5047,
                            "name": "雅瑶",

                        },
                        {
                            "code": 69625448,
                            "name": "钟落潭",

                        }
                    ]
                },
                {
                    "code": 440115,
                    "name": "南沙区",
                    "subLevelModelList": [
                        {
                            "code": 34754747,
                            "name": "板头",

                        },
                        {
                            "code": 2126,
                            "name": "大岗",

                        },
                        {
                            "code": 2061,
                            "name": "东涌",

                        },
                        {
                            "code": 34746521,
                            "name": "大涌",

                        },
                        {
                            "code": 2393,
                            "name": "黄阁",

                        },
                        {
                            "code": 34575009,
                            "name": "华汇广场",

                        },
                        {
                            "code": 7081,
                            "name": "横沥",

                        },
                        {
                            "code": 34590742,
                            "name": "金洲",

                        },
                        {
                            "code": 5761,
                            "name": "榄核",

                        },
                        {
                            "code": 89089263,
                            "name": "伦教",

                        },
                        {
                            "code": 35401132,
                            "name": "南沙区府",

                        },
                        {
                            "code": 101005788,
                            "name": "容桂",

                        },
                        {
                            "code": 81957595,
                            "name": "十九涌",

                        },
                        {
                            "code": 81303176,
                            "name": "万顷沙镇",

                        },
                        {
                            "code": 34582728,
                            "name": "新垦镇",

                        },
                        {
                            "code": 3796,
                            "name": "鱼窝头",

                        },
                        {
                            "code": 34644352,
                            "name": "珠江旧镇",

                        }
                    ]
                },
                {
                    "code": 440112,
                    "name": "黄埔区",
                    "subLevelModelList": [
                        {
                            "code": 3053,
                            "name": "长洲",

                        },
                        {
                            "code": 7060,
                            "name": "东圃",

                        },
                        {
                            "code": 493,
                            "name": "大沙",

                        },
                        {
                            "code": 81024647,
                            "name": "大沙东",

                        },
                        {
                            "code": 3742,
                            "name": "丰乐北路",

                        },
                        {
                            "code": 34613258,
                            "name": "高唐",

                        },
                        {
                            "code": 34581159,
                            "name": "黄村",

                        },
                        {
                            "code": 2199,
                            "name": "红山",

                        },
                        {
                            "code": 35731358,
                            "name": "九佛",

                        },
                        {
                            "code": 34571481,
                            "name": "开发东区",

                        },
                        {
                            "code": 95966817,
                            "name": "开发区",

                        },
                        {
                            "code": 34576644,
                            "name": "开发区东区",

                        },
                        {
                            "code": 34698133,
                            "name": "开发区西区",

                        },
                        {
                            "code": 34569540,
                            "name": "科学城",

                        },
                        {
                            "code": 81435213,
                            "name": "萝岗高德汇",

                        },
                        {
                            "code": 34587242,
                            "name": "联和联世广场",

                        },
                        {
                            "code": 2689,
                            "name": "荔联",

                        },
                        {
                            "code": 1289,
                            "name": "南岗",

                        },
                        {
                            "code": 35954188,
                            "name": "区府",

                        },
                        {
                            "code": 87752034,
                            "name": "前进",

                        },
                        {
                            "code": 6742,
                            "name": "穗东",

                        },
                        {
                            "code": 54095453,
                            "name": "生活区",

                        },
                        {
                            "code": 82106762,
                            "name": "太平",

                        },
                        {
                            "code": 2788,
                            "name": "文冲",

                        },
                        {
                            "code": 34575863,
                            "name": "万达广场",

                        },
                        {
                            "code": 99323762,
                            "name": "新塘广场",

                        },
                        {
                            "code": 34590069,
                            "name": "小新塘",

                        },
                        {
                            "code": 80992711,
                            "name": "夏园",

                        },
                        {
                            "code": 1634,
                            "name": "鱼珠",

                        },
                        {
                            "code": 1046,
                            "name": "镇龙",

                        },
                        {
                            "code": 49937734,
                            "name": "知识城",

                        },
                        {
                            "code": 35041849,
                            "name": "中新",

                        },
                        {
                            "code": 34566670,
                            "name": "中心城",

                        }
                    ]
                },
                {
                    "code": 440113,
                    "name": "番禺区",
                    "subLevelModelList": [
                        {
                            "code": 34569437,
                            "name": "长隆",

                        },
                        {
                            "code": 1479,
                            "name": "东环",

                        },
                        {
                            "code": 180,
                            "name": "大石",

                        },
                        {
                            "code": 531,
                            "name": "大学城",

                        },
                        {
                            "code": 55765711,
                            "name": "番禺广场",

                        },
                        {
                            "code": 86807910,
                            "name": "工业大道",

                        },
                        {
                            "code": 34602137,
                            "name": "广州南站",

                        },
                        {
                            "code": 34788944,
                            "name": "华南",

                        },
                        {
                            "code": 48702329,
                            "name": "汉溪",

                        },
                        {
                            "code": 62914394,
                            "name": "洛浦",

                        },
                        {
                            "code": 1572,
                            "name": "洛溪",

                        },
                        {
                            "code": 34568942,
                            "name": "南村",

                        },
                        {
                            "code": 2633,
                            "name": "南浦",

                        },
                        {
                            "code": 2189,
                            "name": "祈福",

                        },
                        {
                            "code": 3457,
                            "name": "桥南",

                        },
                        {
                            "code": 1061,
                            "name": "石基",

                        },
                        {
                            "code": 81028295,
                            "name": "厦滘",

                        },
                        {
                            "code": 2319,
                            "name": "石楼",

                        },
                        {
                            "code": 23,
                            "name": "市桥",

                        },
                        {
                            "code": 3269,
                            "name": "石碁",

                        },
                        {
                            "code": 50256243,
                            "name": "市桥东",

                        },
                        {
                            "code": 179,
                            "name": "沙头",

                        },
                        {
                            "code": 2550,
                            "name": "沙湾",

                        },
                        {
                            "code": 97735312,
                            "name": "三洲社区",

                        },
                        {
                            "code": 81491515,
                            "name": "万达",

                        },
                        {
                            "code": 48635424,
                            "name": "星河湾",

                        },
                        {
                            "code": 34672789,
                            "name": "新造",

                        },
                        {
                            "code": 48775435,
                            "name": "雅居乐",

                        },
                        {
                            "code": 52587524,
                            "name": "亚运城",

                        },
                        {
                            "code": 35436539,
                            "name": "亚运大道中",

                        },
                        {
                            "code": 1733,
                            "name": "钟村",

                        }
                    ]
                }
            ]
}